[
  {
    "title": "The World Is Producing More Food than Ever—but Not for Long",
    "source": "Wired",
    "publishedAt": "2025-06-28T11:00:00Z",
    "url": "https://www.wired.com/story/the-world-is-producing-more-food-than-ever-before-but-not-for-long/",
    "summary": "– Climate change isn't just bad news for farmers, it's bad news for everyone who eats. According to a new study published in Nature, six key staple crops will see an 11.2 percent decline in harvests by the end of the century, compared to a world without warming, reports the New York Times. The biggest drops aren't occurring in the poorer, more marginal farmlands, but in places that are already major food producers"
  },
  {
    "title": "A Wood Chipper from First Principles",
    "source": "Hackaday",
    "publishedAt": "2025-06-28T08:00:00Z",
    "url": "https://hackaday.com/2025/06/28/a-wood-chipper-from-first-principles/",
    "summary": "– Wood chippers are among the more dangerous tools that are easily available to anyone with enough money to buy one or enough skill to build one, so make sure to take appropriate safety precautions when using or building any of these things, as well as chainsaws, angle grinders, and table saws. Of course, these tools are among the more dangerous tools that are easily available to anyone with enough money to buy one or enough skill to build one, along with chainsaws"
  },
  {
    "title": "ICE Rolls Facial Recognition Tools Out to Officers' Phones",
    "source": "Wired",
    "publishedAt": "2025-06-28T10:30:00Z",
    "url": "https://www.wired.com/story/ice-rolls-facial-recognition-tools-out-to-officers-phones/",
    "summary": "– The US Supreme Court upheld a Texas porn ID law on Friday, ruling that age verification for explicit sites is constitutional. In a 6-3 decision on Friday, the US Supreme Court upheld a Texas porn ID law, finding that age verification for explicit sites is constitutional. In a dissent, Justice Elena Kagan warned that this determination ignores First Amendment precedent and will have privacy implications for adults. In a 6-3 decision on Friday, the"
  },
  {
    "title": "Tesla says it delivered its first car autonomously from factory to customer",
    "source": "The Verge",
    "publishedAt": "2025-06-28T13:51:44Z",
    "url": "https://www.theverge.com/news/694801/tesla-autonomous-delivery-factory-customer-robotaxi",
    "summary": "– Tesla has completed its first fully autonomous vehicle delivery from factory to customer, reports the New York Daily News. Tesla CEO Elon Musk had promised the first fully autonomous delivery would take place on June 28th. But on Friday, he announced that the milestone had been achieved a day early. \"To best our knowledge, this is the first fully autonomous drive with no people in the car at all and no remote operators in control at any point. FULLY autonomous!\" Musk wrote on"
  },
  {
    "title": "Fancy Airplane Seats Have Nowhere Left to Go—So What Now?",
    "source": "Wired",
    "publishedAt": "2025-06-28T11:00:00Z",
    "url": "https://www.wired.com/story/fancy-airplane-seats-have-nowhere-left-to-go-so-what-now/",
    "summary": "– If you're a business traveler and you're looking for a private suite that's more akin to a bijou hotel room, you're in for a treat. But what if there's no more room left to give? \"Business class used to be all about hardware—the seat, the screen, the privacy door. But now it's about human-centred design,\" says Nigel Goode, chairman of"
  },
  {
    "title": "Rubin Observatory’s Stunning Result Proves It’s a ‘Game Changer’ for Spotting Dangerous Asteroids",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-28T10:00:05Z",
    "url": "https://gizmodo.com/rubin-observatorys-stunning-result-proves-its-a-game-changer-for-spotting-dangerous-asteroids-2000621581",
    "summary": "– Scientists from the Vera C. Rubin Observatory, a joint effort of the National Science Foundation and the Department of Energy's Office of Science, unveiled their first images of the telescope Monday, reports Gizmodo. The observatory's first 10 hours of test observations revealed more than 2,000 previously unknown asteroids, including seven near-Earth asteroids. Rubin is a planetary astronomer's dream come true, and"
  },
  {
    "title": "Japan loves them. And now they're in the UK - strawberries and cream sandwiches",
    "source": "BBC News",
    "publishedAt": "2025-06-28T00:37:40Z",
    "url": "https://www.bbc.com/news/articles/c75rdryk63lo",
    "summary": "– M&S has rolled out a limited-edition strawberries and cream sandwich, which it says is inspired by the \"viral Japanese fruit sando.\" The sandwich, made with strawberries, whipped cream cheese and sweetened bread, was the top-seller in the UK the two days after its launch, reports the BBC. The sandwich is available at some Japanese bakeries, but M&S says it's the first time it's been widely"
  },
  {
    "title": "Your member of Congress might be using ChatGPT",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T09:46:01Z",
    "url": "https://www.businessinsider.com/members-congress-politicians-using-chatgpt-grok-ai-2025-6",
    "summary": "– In December, Rep. Thomas Massie used an analogy for foreign aid that was an instant hit among his libertarian and America-First Republican fans. \"US foreign aid spending is like watering the neighbor's yard while your house is on fire,\" the Kentucky Republican posted on X, adding a fire emoji. Fox News wrote an article about it, and two months later, the libertarian student group \"Young Americans for Liberty\""
  },
  {
    "title": "Building A 3D-Printed RC Dump Truck",
    "source": "Hackaday",
    "publishedAt": "2025-06-28T05:00:52Z",
    "url": "https://hackaday.com/2025/06/27/building-a-3d-printed-rc-dump-truck/",
    "summary": "– A 3D-printed dump truck isn't exactly a dream come true for many of us, but it's a dream come true for many of us. The tractor is a fairly straightforward custom RC build, albeit with a few extra features to make it fit for purpose. It's got six wheels as befitting a proper semi, and it has a retractable magnetic hitch mechanism that lets it hook up to various trailer"
  },
  {
    "title": "Hard to imagine a worse time to deport Afghan refugees, human rights advocates say",
    "source": "NPR",
    "publishedAt": "2025-06-28T11:01:05Z",
    "url": "https://www.npr.org/sections/goats-and-soda/2025/06/28/g-s1-74742/afghan-refugees-afghanistan-deported-pakistan-iran",
    "summary": "– The U.N. has released a new report that says 71,000 Afghan refugees were deported from the two countries between June 1 and June 15, adding to the millions who have been deported or left since 2023, reports the Guardian. The report, which was released by the United Nations on Thursday, says that 71,000 Afghan refugees were deported from the two countries between June 1 and June 15, adding to the millions who have been deported or left since 2023. The"
  },
  {
    "title": "Catio wins ‘coolest tech’ award at VB Transform 2025",
    "source": "VentureBeat",
    "publishedAt": "2025-06-28T00:34:26Z",
    "url": "https://venturebeat.com/ai/catio-wins-coolest-tech-award-at-vb-transform-2025/",
    "summary": "– Catio has been named the Coolest Technology at VentureBeat Transform 2025 in San Francisco. The AI Copilot for Tech Architecture combines a real-time architectural map with a multi-agent AI organization to help engineering teams shift from reactive decision-making to proactive architecture excellence. The company, founded in 2023, has raised $7 million to date, with a recent $3 million round announced in March. Catio's AI Copilot for"
  },
  {
    "title": "Atomic Heart team wants to ‘troll flat-earthers’ with new MMO The Cube",
    "source": "Polygon",
    "publishedAt": "2025-06-28T11:54:59Z",
    "url": "https://www.polygon.com/preview/609494/the-cube-interview-atomic-heart-developers-mundfish",
    "summary": "– The Cube is a massive multiplayer shooter from Atomic Heart developer Mundfish. It's a floating, rotating, basically shape-shifting block that's been dubbed The Cube, reports GameFest. \"We want to troll the guys who believe our Earth is a plane,\" Robert Bagratuni, CEO of Mundfish, tells GameFest. \"Why not a triangle, or a pyramid, or"
  },
  {
    "title": "Ex-NATO hacker: 'In the cyber world, there's no such thing as a ceasefire'",
    "source": "Theregister.com",
    "publishedAt": "2025-06-28T14:01:10Z",
    "url": "https://www.theregister.com/2025/06/28/exnato_hacker_ceasefire_iran/",
    "summary": "– A ceasefire between Iran and Israel may prevent the two countries from firing missiles at each other, but it won't carry any weight in cyberspace, says former NATO hacker Candan Bolukbas. \"In the cyber world, there's no such thing as a ceasefire,\" Bolukbas tells the Register. \"In the cyber world, there's no such thing as a ceasefire,\" he says. \"In the cyber world,"
  },
  {
    "title": "How to get free software from yesteryear's IT crowd – trick code into thinking it's running on a rival PC",
    "source": "Theregister.com",
    "publishedAt": "2025-06-28T08:30:11Z",
    "url": "https://www.theregister.com/2025/06/28/hacks_to_get_free_software/",
    "summary": "– It's been a long time since plug-and-play has been used in Windows 95, but a few days ago, a team of Microsoft engineers found some unusual text in the BIOS of several old PCs that they had to retrofit to their legacy hardware. \"One of the strings they found was 'Not Copyright Fabrikam Computer',\" says Microsoft's Raymund Chen, referring to a \"Not Copyright "
  },
  {
    "title": "June is National Safety Month, and these Android phones could help save your life",
    "source": "Android Central",
    "publishedAt": "2025-06-28T12:00:00Z",
    "url": "https://www.androidcentral.com/phones/june-is-national-safety-month-and-these-android-phones-could-help-save-your-life",
    "summary": "– National Safety Month is a time to raise awareness about the causes of preventable injuries and highlight ways to stay safe. In honor of National Safety Month, we're going to highlight the personal safety suites available on each of these popular Android phones. The Samsung Galaxy S25 series has a car crash detection sensor that is currently unused, and a satellite connectivity feature that is left up to carriers rather than being universal. The Google Pixel 9 lineup has a car crash"
  },
  {
    "title": "Where the Voting Rights Act stands after the Supreme Court punts on a Louisiana case",
    "source": "NPR",
    "publishedAt": "2025-06-28T09:00:00Z",
    "url": "https://www.npr.org/2025/06/28/nx-s1-5445336/supreme-court-louisiana-redistricting-voting-rights-act",
    "summary": "– In a rare decision this week, the U.S. Supreme Court postponed ruling on a Louisiana congressional redistricting case that could have implications on legal protections for the rights of minority voters across the country. The court's decision on Friday did not explain why the court wants to hear oral arguments again in Louisiana v. Callais during its next term that is expected to start in October. \"The fact that the Court is rearguing"
  },
  {
    "title": "I'm a drag queen in NYC whose bookings for Pride Month have plummeted this year. I'm trying to work smarter, not harder.",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T09:19:02Z",
    "url": "https://www.businessinsider.com/drag-queen-nyc-brita-filter-pride-bookings-down-corporate-support-2025-6",
    "summary": "– Brita Filter's popularity went mainstream when she appeared on season 12 of \"RuPaul's Drag Race,\" and she's made appearances on \"Saturday Night Live,\" \"Broad City,\" and \"The Daily Show with Trevor Noah.\" Brita Filter, 39, is a household name in drag entertainment. Her popularity went mainstream when she appeared on season 12 of \"RuPaul's Drag Race,\" and she's made appearances on \""
  },
  {
    "title": "Lorde's new album 'Virgin' is messy, emotional, and perfectly suited for the moment",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T09:02:01Z",
    "url": "https://www.businessinsider.com/lorde-virgin-album-review-career-arc-since-royals-2025-6",
    "summary": "– It's been a long time since Lorde's \"Royals\" was released, and it's been a long time since she's been portrayed as elusive and infallible by fans and media outlets alike. \"I've never seen a diamond in the flesh,\" she tells Business Insider. \"Royals\" was released as a single in 2013, just a few years after Instagram was launched. Now"
  },
  {
    "title": "Tesla's first fully autonomous car drove itself to its new Texas owner, doing 72 mph on the highway, an engineer says",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T00:56:31Z",
    "url": "https://www.businessinsider.com/tesla-first-fully-autonomous-car-delivered-texas-owner-2025-6",
    "summary": "– Elon Musk's self-driving Tesla Model Y has delivered itself to its new home in Texas, reports Business Insider. \"The first fully autonomous delivery of a Tesla Model Y from factory to a customer home across town, including highways, was just completed a day ahead of schedule,\" Musk wrote on X. \"To best our knowledge, this is the first fully autonomous drive with no people in the car at all and no remote operators"
  },
  {
    "title": "The Supreme Court just upended internet law, and I have questions",
    "source": "The Verge",
    "publishedAt": "2025-06-28T11:00:36Z",
    "url": "https://www.theverge.com/analysis/694710/supreme-court-fsc-paxton-age-verification-questions",
    "summary": "– The Supreme Court has ruled that using age verification to gate adult content violates the First Amendment in the US. As of Friday, it's an unambiguous \"no.\" The Court's ruling in Free Speech Coalition v. Paxton is a relatively straightforward as Supreme Court rulings go. \"For roughly 20 years the answer has been \"yes\" — now it's an unambiguous \"no.\" \"The risks aren't"
  },
  {
    "title": "Swarms of robots could go up your nose, melt the mucus and clean your sinuses",
    "source": "ZME Science",
    "publishedAt": "2025-06-28T11:14:38Z",
    "url": "https://www.zmescience.com/future/swarms-of-tiny-robots-could-go-up-your-nose-melt-the-mucus-and-clean-your-sinuses/",
    "summary": "– A Chinese team has developed a swarm of microbots that can be injected up the nasal cavity, through the nostril. The robots are guided by electromagnetism and can create chemical reactions that wipe out bacterial infections and clear the sinuses, reports the New York Times. They’re guided by electromagnetism and can create chemical reactions that wipe out bacterial infections and clear the sinuses. But would people do it"
  },
  {
    "title": "A Reboot for Capitalism’s Operating System",
    "source": "The Atlantic",
    "publishedAt": "2025-06-28T12:00:00Z",
    "url": "https://www.theatlantic.com/economy/archive/2025/06/reboot-capitalism-operating-system/683308/",
    "summary": "– The world economy is getting a hardware refit and trying out a new operating system—in effect, a full reboot—the likes of which we have not seen in nearly a century. To understand why this is happening and what it means, we need to abandon any illusion that the global turn toward right-wing populism and economic nationalism is merely a temporary error. To understand why this is happening, we need to abandon any illusion that the"
  },
  {
    "title": "Decoding Tesla’s New “Fully Autonomous” Car Video—and What It Isn’t Telling You",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-28T12:50:31Z",
    "url": "https://gizmodo.com/decoding-teslas-new-fully-autonomous-car-video-and-what-it-isnt-telling-you-2000621768",
    "summary": "– Elon Musk's Tesla has dropped a 30-minute video designed to electrify fans and stir debate. The clip shows what Musk claims is a historic milestone: the first fully autonomous delivery of a Tesla Model Y from factory to a customer home across town, including highways, was just completed a day ahead of schedule. \"To best of our knowledge, this is the first fully autonomous delivery of a Tesla Model Y from factory to a"
  },
  {
    "title": "Behind the Bally Home Computer System",
    "source": "Hackaday",
    "publishedAt": "2025-06-28T11:00:00Z",
    "url": "https://hackaday.com/2025/06/28/behind-the-bally-home-computer-system/",
    "summary": "– The Bally Home Computer System, which was based on the Z80 microprocessor that was used in other popular PCs of the era, was a cult favorite among gamers. It was based on the Z80 microprocessor that was used in other popular PCs of the era, but it was never a commercial success. In fact, it was the first home-based video game console to be built by a company known as A"
  },
  {
    "title": "The 10 most affordable states to buy a home if you're single",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T14:03:01Z",
    "url": "https://www.businessinsider.com/states-more-affordable-for-single-homebuyers-2025-6",
    "summary": "– As of June, the US median listing price for single Americans was $440,000, according to Realtor.com, a steep cost for many Americans who live from paycheck to paycheck or are severely cost-burdened, meaning they spend more than 30% of their income on housing. The 10 most affordable states for singles have median listing prices below $440,000, with monthly mortgage payments, excluding the cost of tax and home insurance, under $2,000 — based on a"
  },
  {
    "title": "Getting tickets for fitness competitions like Hyrox is almost as hard as seeing Taylor Swift",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T08:00:01Z",
    "url": "https://www.businessinsider.com/getting-hyrox-tickets-like-taylor-swift-demand-soaring-fitness-competitions-2025-6",
    "summary": "– Hyrox is a mass fitness contest that's taking the world by storm, and it's getting more and more popular, Business Insider reports. \"It was like Glastonbury,\" Emily Harding tells Business Insider. \"I almost thought roping in my housemate too,\" she tells Business Insider. \"It was like Glastonbury,\" she tells Business Insider. \"It was like Glastonbury.\" Hyrox"
  },
  {
    "title": "Inside Jeff Bezos and Lauren Sánchez's Venetian vows",
    "source": "Business Insider",
    "publishedAt": "2025-06-28T10:30:01Z",
    "url": "https://www.businessinsider.com/bi-today-jeff-bezos-lauren-sanchez-venice-wedding-2025-6",
    "summary": "– Amazon founder Jeff Bezos and philanthropist Lauren Sánchez got married in Venice in June 2025, reports Business Insider. \"This magical place has gifted us unforgettable memories,\" Bezos said on their wedding invitation. \"This magical place has gifted us unforgettable memories,\" Sánchez said on the invitation. \"This magical place has gifted us unforgettable memories,\" Bezos said on the invitation. \"This magical place has gifted us unforgettable"
  },
  {
    "title": "M3GAN 2.0's Deeper Meaning Is Going To Make A Lot Of People Uncomfortable",
    "source": "/FILM",
    "publishedAt": "2025-06-28T11:00:00Z",
    "url": "https://www.slashfilm.com/1896352/m3gan-2-deeper-meaning-people-uncomfortable/",
    "summary": "– The new \"M3GAN 2.0\" movie isn't exactly a \"M3GAN\" movie, but it's a story about the dangers of allowing AI to go unchecked and the inherent danger of allowing technology to replace human connection, the Hollywood Reporter reports. \"M3GAN 2.0's\" marketing and much of the story would lead the audience to believe that the villain is Amelia (Ivanna Sak"
  },
  {
    "title": "Israel's leaders slam a news report on a Gaza 'killing field' near food sites",
    "source": "NPR",
    "publishedAt": "2025-06-28T10:16:45Z",
    "url": "https://www.npr.org/2025/06/28/nx-s1-5449587/israel-gaza-haaretz-report",
    "summary": "– Israel's leaders slammed a Haaretz report on a Gaza 'killing field' near food distribution sites Friday, calling it a \"blood libel\" and \"malicious falsehoods designed to defame the IDF [Israel Defense Forces], the most moral military in the world,\" the AP reports. \"These are malicious falsehoods designed to defame the IDF [Israel Defense Force"
  },
  {
    "title": "Scientists turn beer yeast into mini factories for smart drugs",
    "source": "Science Daily",
    "publishedAt": "2025-06-28T14:06:20Z",
    "url": "https://www.sciencedaily.com/releases/2025/06/250627234114.htm",
    "summary": "– Scientists at the Ca' Foscari University of Venice have developed an innovative method to produce and quickly analyze a vast array of macrocyclic peptides, molecules increasingly used in modern medicine. To overcome these limitations, the researchers engineered common brewer's yeast cells to individually produce different macrocyclic peptides. Each yeast cell acts like a tiny factory that lights up when prod-ucing the compound, allowing scientists"
  }
]