[
  {
    "title": "Break The Air Gap With Ultrasound",
    "source": "Hackaday",
    "publishedAt": "2025-06-30T02:00:53Z",
    "url": "https://hackaday.com/2025/06/29/break-the-air-gap-with-ultrasound/",
    "summary": "– If you're a fan of ultrasonic keyboarding, you're in for a treat: It's a web interface that encodes text as ultrasonic frequency shift keying, and it's way above the human hearing range. It's a fun toy, but at least on this laptop, we wouldn't call it reliable. The code is on the linked page, if you want more ultrasonic goodness, and"
  },
  {
    "title": "Uncaging the Bird in the Mind: William Henry Hudson and the Gift of the Ruin of Your Best Laid Plans",
    "source": "Themarginalian.org",
    "publishedAt": "2025-06-30T00:23:47Z",
    "url": "https://www.themarginalian.org/2025/06/29/william-henry-hudson-idle-days-in-patagonia/",
    "summary": "– William Henry Hudson was born in Argentina in 1841 and died in Buenos Aires on August 18, 1922, a year after he lost his mother to a cholera epidemic. Hudson, who died in a car accident, was a pioneer in the field of ornithology, and he was a pioneer in the field of ornithology. \"The mind is its own place, and in it self can make "
  },
  {
    "title": "Marchers cap Pride Month with celebration and protest",
    "source": "NPR",
    "publishedAt": "2025-06-30T00:10:18Z",
    "url": "https://www.npr.org/2025/06/29/nx-s1-5450322/pride-march-new-york-budapest-san-francisco",
    "summary": "– At the last day of Pride Month, revelers around the world celebrated and also demonstrated for LGBTQ+ rights and inclusion. In addition to waving rainbow flags, many of them also held protest signs for LGBTQ+ rights and inclusion, amid increasing political attacks in the U.S. by Republicans and President Trump's administration. \"Our joy is our resistance,\" read one sign held by a reveler wearing samba feathers at New York City's Pride parade,"
  },
  {
    "title": "ASMOKE’s battery-powered pellet grill brings wood-fired flavor anywhere",
    "source": "Yanko Design",
    "publishedAt": "2025-06-30T01:45:24Z",
    "url": "https://www.yankodesign.com/2025/06/29/asmokes-battery-powered-pellet-grill-brings-wood-fired-flavor-anywhere/",
    "summary": "– The ASMOKE Essential is a battery-powered pellet grill that packs a 95Wh removable battery that delivers up to 10 hours of consistent cooking power, transforming any location into a legitimate outdoor kitchen, reports the New York Times. The Essential packs a 271 square inches of cooking space, but it's perfectly sized for the target use cases: camping trips, tailgating adventures, and urban balcony cooking where space and power access are premium commodities."
  },
  {
    "title": "Xiaomi’s new AI glasses are already giving Ray-Ban Metas a serious beatdown",
    "source": "Android Central",
    "publishedAt": "2025-06-30T00:53:22Z",
    "url": "https://www.androidcentral.com/gaming/virtual-reality/xiaomis-new-ai-glasses-are-already-giving-ray-ban-metas-a-serious-beatdown",
    "summary": "– Xiaomi's new AI-powered glasses aren't Ray-Ban's, but they're a big step in the right direction. The 12MP camera onboard lets you snap photos or shoot first-person videos hands-free, plus it can ID stuff and translate text on the fly. The glasses can scan a QR code, then double-check with the voice assistant to make sure you're actually making the purchase, the company said in "
  },
  {
    "title": "Japan just axed the Google Pixel 7, and the 8 and 9 might be next on the chopping block",
    "source": "Android Central",
    "publishedAt": "2025-06-30T03:45:51Z",
    "url": "https://www.androidcentral.com/phones/google-pixel/japan-just-axed-the-google-pixel-7-and-the-8-and-9-might-be-next-on-the-chopping-block",
    "summary": "– A Japanese court ruled that Google's Pixel 7 series stepped on Pantech's standard-essential patents without a proper license, and now the company is off the shelves in the country, reports ETNews. The court's decision came down to Google using Pantech's technology without a proper license, which is supposed to be fairly shared across the industry under FRAND (fair, reasonable, and non-discriminatory) terms"
  },
  {
    "title": "For Trump, Politics Is Battle",
    "source": "Realclearworld.com",
    "publishedAt": "2025-06-30T02:28:28Z",
    "url": "https://www.realclearworld.com/articles/2025/06/26/for_trump_politics_is_battle_1119005.html",
    "summary": "– Niccolo Machiavelli's theory of politics is based on his study of human nature: People are motivated by a capricious self-interest, he wrote in The Prince and Discourses. \"This is to be asserted in general of men,\" he wrote. \"That they are ungrateful, fickle, false, cowardly, covetous,\" and compete incessantly for power, resources,"
  },
  {
    "title": "Technology's Battle of Good versus Evil",
    "source": "Psychology Today",
    "publishedAt": "2025-06-30T02:19:39Z",
    "url": "https://www.psychologytoday.com/us/blog/deconstructing-illness/202506/technologys-battle-of-good-versus-evil",
    "summary": "– It's been a long time since humans were able to survive on Earth, and now it's time for a new era to begin. \"The technology that humans create to make their lives better and safer can be wielded for terror and danger, threatening humanity's very existence,\" says the New York Times. \"The spear to hunt animals to feed the tribe can also be used to kill another human within the tribe,\" he writes."
  },
  {
    "title": "Canada rescinds digital services tax after Trump suspends trade talks",
    "source": "Al Jazeera English",
    "publishedAt": "2025-06-30T03:01:32Z",
    "url": "https://www.aljazeera.com/news/2025/6/30/canada-rescinds-digital-services-tax-after-trump-suspends-trade-talks",
    "summary": "– Canada has rescinded its digital services tax in a bid to advance trade negotiations with the US, days after US President Donald Trump called off trade talks in retaliation for the levy. Prime Minister Mark Carney says he and Trump have now agreed to resume trade talks with the US, reports Al Jazeera. \"Today’s announcement will support a resumption of negotiations toward the July 21, 2025,"
  },
  {
    "title": "“Everything Old Is New Again!”: 72 Pics From History That Look Confusing Now (New Pics)",
    "source": "Boredpanda.com",
    "publishedAt": "2025-06-30T03:00:22Z",
    "url": "https://www.boredpanda.com/weird-moments-past/",
    "summary": "– Emile Leray set off on a solo journey across the Moroccan desert in 1993 in a Citron 2CV, a lightweight French economy car. He set out on a solo journey in the Sahara Desert in a Citron 2CV, a lightweight French economy car. During his trip, he encountered a military checkpoint that prohibited him from continuing on his planned route. He decided to take a remote off"
  },
  {
    "title": "Is Crypto in a Bubble (Again)?",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-30T03:32:48Z",
    "url": "https://gizmodo.com/is-crypto-in-a-bubble-again-2000621921",
    "summary": "– The crypto world is buzzing, and if you're a skeptic, you're probably in for a surprise: The industry's total market value has ballooned by over $3 trillion since the start of 2023. Circle Internet Group, the firm behind one of the biggest \"stablecoins,\" went public in June at a $6 billion valuation. It shot up to nearly $50 billion in just weeks. \"There’s never"
  },
  {
    "title": "Technology Policy Accelerator: A Bold New Initiative On Emerging Technology",
    "source": "Hoover.org",
    "publishedAt": "2025-06-30T00:00:00Z",
    "url": "https://www.hoover.org/events/technology-policy-accelerator-bold-new-initiative-emerging-technology",
    "summary": "– Martin Giles is the assistant director of the Hoover Technology Policy Accelerator, and he's apologising to those of you who had a little bit of parking trouble this weekend as you made your way through Stanford's campus today. \"I do apologise, those of you had a little bit of parking trouble. You may have seen people taking down tents and awnings, and folding up chairs and tables"
  },
  {
    "title": "Zeekr Intelligent Technology Malaysia established – principal takes over as EV brand’s official distributor",
    "source": "Paul Tan's Automotive News",
    "publishedAt": "2025-06-30T03:43:52Z",
    "url": "https://paultan.org/2025/06/30/zeekr-intelligent-technology-malaysia-established-principal-takes-over-as-ev-brands-official-distributor/",
    "summary": "– Zeekr, the EV brand under the Geely umbrella, has announced that it is taking over operations in Malaysia. Zeekr Intelligent Technology (Malaysia) is the name of the company, and with this, the principal takes over official distributor duties. The NSC will oversee wholesale operations, dealer network expansion, branding and marketing activities, as well as after-sales operations. The company is seeking dealers in Cheras, Kuantan,"
  },
  {
    "title": "Asia shares track Wall St gains before payrolls test",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-30T00:32:52Z",
    "url": "https://finance.yahoo.com/news/asia-shares-track-wall-st-003252544.html",
    "summary": "– Global stocks hit an intraday record on Monday on hopes U.S. trade negotiations with key partners would continue to progress, while the dollar declined and was set for its worst first half performance in more than five decades. On Monday, the S&P 500 and Nasdaq closed at record levels for a second straight session, led by a gain of about 1% in technology, while consumer discretionary was the worst performing of the 11 major S&P sectors."
  },
  {
    "title": "Canadian Prime Minister Carney says trade talks with US resume after Canada rescinded tech tax",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-30T02:34:05Z",
    "url": "https://www.yahoo.com/news/canadian-prime-minister-carney-says-023405782.html",
    "summary": "– Canadian Prime Minister Mark Carney said late Sunday trade talks with U.S. have resumed after Canada rescinded its plan to tax U.S. technology firms, the AP reports. U.S. President Donald Trump said Friday that he was suspending trade talks with Canada over its plans to continue with its tax on technology firms. The Canadian government said \"in anticipation\" of a trade deal \"Canada would rescind\" the Digital"
  },
  {
    "title": "Introducing World of Secrets: The Killing Call",
    "source": "BBC News",
    "publishedAt": "2025-06-30T00:30:00Z",
    "url": "https://www.bbc.co.uk/programmes/p0llmbnr",
    "summary": "– Sidhu Moose Wala, one of India's biggest stars, was gunned down in a hail of bullets. Who wanted him dead and why? Sidhu Moose Wala was one of India's biggest stars — a voice millions followed. Then he was gunned down. Who wanted him dead and why? This is the hunt for answers over a murder that won'"
  },
  {
    "title": "Why Modernist Value Changes?",
    "source": "Overcomingbias.com",
    "publishedAt": "2025-06-30T02:44:09Z",
    "url": "https://www.overcomingbias.com/p/why-modernist-value-changes",
    "summary": "– In the last few centuries many things have changed, and we humans have in response changed many of our values. But in the modern era, we've come to greatly doubt and reject many of our inherited cultural traditions, and in response, we've come to much faster cultural change, from small, isolated, slowly changing, conservative about change, wary about change, and wary about change, from peasant villages to nation-states to a"
  },
  {
    "title": "Paris Fashion Week SS26 Street Style",
    "source": "HYPEBEAST",
    "publishedAt": "2025-06-30T01:05:13Z",
    "url": "https://hypebeast.com/2025/6/paris-fashion-week-ss26-street-style",
    "summary": "– Paris Fashion Week kicked off this week with a dazzling mix of high-low dressing, bold statements, and a relaxed, almost nonchalant confidence. The Louis Vuitton monogram and Rick Owens cult aesthetic dominated this season's street style, with soccer jerseys and gorpcore jerseys dominating the show, reports the New York Times. In contrast, Owens' signature voluminous silhouettes, e"
  },
  {
    "title": "Here Are 105 Of The Best Tweets That Cracked People Up This June",
    "source": "Boredpanda.com",
    "publishedAt": "2025-06-30T03:00:48Z",
    "url": "https://www.boredpanda.com/funny-june-tweets-online/",
    "summary": "– It's been a month of madness, and this month's tweets were no exception. Bored Panda has put together a list of the top funny tweets of the month. They're all from X, the platform formerly known as Twitter, and they're all hilarious."
  },
  {
    "title": "The Hoover Institution Launches Technology Policy Accelerator to Guide US Innovation",
    "source": "Hoover.org",
    "publishedAt": "2025-06-30T00:00:00Z",
    "url": "https://www.hoover.org/news/hoover-institution-launches-technology-policy-accelerator-guide-us-innovation",
    "summary": "– The Hoover Institution has officially launched the Technology Policy Accelerator, a bold new initiative aimed at helping US government and business leaders navigate the rapidly evolving landscape of emerging technologies and their implications for national security, economic growth, and global leadership. The TPA's mission is to support more informed policymaking by producing insights that clarify how emerging technologies are reshaping geopolitics, society, and the economy. It operates as a collaborative hub—connecting"
  },
  {
    "title": "The adidas Dame X Embraces Chilly “Flash Aqua”",
    "source": "Sneaker News",
    "publishedAt": "2025-06-30T00:00:50Z",
    "url": "https://sneakernews.com/2025/06/29/adidas-dame-x-flash-aqua-core-black-grey-two-jp6079/",
    "summary": "– The adidas Dame X is set to make its debut in July, and it's going to be a big step forward for the brand, reports Sneaker News. The Dame X is expected to debut in July, and it's expected to be a \"budget\" option, with Spida and Ant at the bottom of the vertical, and Ant and Spida and Ant at the bottom of the vertical, reports the New York Times."
  },
  {
    "title": "Palantir Co-founder Peter Thiel Discusses The Antichrist and Transhumanism in Latest Interview (VIDEO)",
    "source": "Thegatewaypundit.com",
    "publishedAt": "2025-06-30T02:20:56Z",
    "url": "https://www.thegatewaypundit.com/2025/06/palantir-co-founder-peter-thiel-discusses-antichrist-transhumanism/",
    "summary": "– Peter Thiel, co-founder of Palantir, recently met with New York Times columnist Ross Douthat to discuss many topics, including innovation, life extension technology, the antichrist, and transhumanism. Douthat asked Thiel, \"Should the human race survive?\" Thiel replied, \"Yes. But I also would like us to radically solve these problems. And so it’s always, I don’t know, yeah—transhuman"
  },
  {
    "title": "The Most Insane Steam Summer Savings Pinpointed, the Finest Console AAA Cuts, and More!",
    "source": "IGN",
    "publishedAt": "2025-06-30T02:23:57Z",
    "url": "https://www.ign.com/articles/the-most-insane-steam-summer-savings-pinpointed-the-finest-console-aaa-cuts-and-more-au-deals",
    "summary": "– If you're a fan of retro gaming, this week's gaming deals are a treasure trove of gold-plated discounts and cult classics ripe for the picking. Whether you're looking to binge your backlog or dip into something new before tax season wipes you out, I've found you hidden value on every platform. Whether you're looking to binge your backlog or dip into something new before EO"
  },
  {
    "title": "Canada rescinds digital services tax in bid to advance trade talks with US",
    "source": "AOL",
    "publishedAt": "2025-06-30T02:25:09Z",
    "url": "https://www.aol.com/news/canada-rescinds-digital-services-tax-022509895.html",
    "summary": "– The U.S. will resume trade negotiations with Canada immediately after Ottawa scrapped its digital services tax targeting U.S. technology firms, White House economic adviser Kevin Hassett said on Monday. \"Absolutely,\" Hassett said on Fox News Channel when asked about the talks restarting. \"Absolutely,\" Hassett said on Fox News Channel when asked about the talks restarting. \"It's something that they've studied, now"
  },
  {
    "title": "Nearly 12 Million Would Lose Their Health Care Coverage",
    "source": "Politicalwire.com",
    "publishedAt": "2025-06-30T02:58:43Z",
    "url": "https://politicalwire.com/2025/06/29/nearly-12-million-will-lose-their-health-care-coverage/",
    "summary": "– Republicans' marquee domestic policy bill that is making its way through the Senate could mean deeper cuts and more Americans losing health insurance coverage than the original measure that passed the House last month, according to new estimates from the Congressional Budget Office. According to a report published late Saturday night, the legislation would mean 11.8 million more Americans would become uninsured by 2034. Federal spending on Medicaid, Medicare and Obamacare would be reduced by more than $1.1 trillion over that"
  },
  {
    "title": "MARCORSYSCOM Leaders Chart Future of Marine Readiness at Future Soldier Technology USA conference",
    "source": "Soldiersystems.net",
    "publishedAt": "2025-06-30T00:00:00Z",
    "url": "https://soldiersystems.net/2025/06/30/marcorsyscom-leaders-chart-future-of-marine-readiness-at-future-soldier-technology-usa-conference/",
    "summary": "– As the character of warfare shifts and threats evolve, so does the demand for new approaches to equipping the dismounted warfighter. At this year's Future Soldier Technology USA conference, defense leaders from across the globe gathered to discuss what it takes to make the dismounted Soldier and Marine faster, more lethal, more resilient, and better protected—all while preparing for a future fight that may look very different from the last. At the event, several leaders"
  },
  {
    "title": "How to Overcome Habituation",
    "source": "Psychology Today",
    "publishedAt": "2025-06-30T00:04:36Z",
    "url": "https://www.psychologytoday.com/us/blog/transcending-the-past/202506/how-to-overcome-habituation",
    "summary": "– We're living in a time when great troubles stalk the land, and we're experiencing a heightened sense of survival fear—that is, the fear of not being able to survive. But what's going on when we adapt to dangerous situations and no longer respond to a threat? \"What is going on when we adapt to dangerous situations and no longer respond to a threat?\" asks the author of a new book. \"We're"
  },
  {
    "title": "Timeless Grace: 1940s Wedding Dresses in an Age of Restraint",
    "source": "Vintag.es",
    "publishedAt": "2025-06-30T00:57:00Z",
    "url": "https://www.vintag.es/2025/06/1940s-wedding-dresses.html",
    "summary": "– The 1940s were a time when wedding dresses were a little more sophisticated and sophisticated than they were in the 1950s, reports the New York Times. The 1940s were a time when wartime austerity and postwar optimism shaped the style of wedding dresses. Gowns often featured modest silhouettes with high necklines, long sleeves, and A-line or floor-length skirts. Details like shoulder pads, covered buttons, and subtle embroidery added structure"
  },
  {
    "title": "AI in Smartphones: The Good, The Bad, and The Gimmick",
    "source": "Gizchina.com",
    "publishedAt": "2025-06-30T02:57:47Z",
    "url": "https://www.gizchina.com/2025/06/29/ai-in-smartphones-the-good-the-bad-and-the-gimmick/",
    "summary": "– The first half of 2025 is almost upon us, and it's no surprise to see that smartphone makers are seeing AI as the new segment that they need to focus on, reports TechCrunch. The first half of 2025 is the first half of 2025, and it's no surprise that we're seeing more and more smartphones coming and promising revolutionary AI for better usage, better cameras, better design, and better everything, reports TechCrunch. The"
  },
  {
    "title": "Guardiola worried that lack of rest after Club World Cup could 'destroy' Man City",
    "source": "CNA",
    "publishedAt": "2025-06-30T03:00:49Z",
    "url": "https://www.channelnewsasia.com/sport/guardiola-worried-lack-rest-after-club-world-cup-could-destroy-man-city-5210831",
    "summary": "– Pep Guardiola says Manchester City's involvement in the Club World Cup could \"destroy\" his squad ahead of the new Premier League season. \"I may say, so listen, we are a disaster. We are exhausted. The World Cup destroyed us,\" he tells reporters. \"I don’t know, but it’s the first time in our life that that’s happened. So we’ll see,\" he says. \"I understand"
  }
]