[
  {
    "title": "Joby delivers first aircraft to Dubai as air taxi service nears launch",
    "source": "The Verge",
    "publishedAt": "2025-06-29T12:23:14Z",
    "url": "https://www.theverge.com/news/694515/joby-delivers-first-aircraft-to-dubai-as-air-taxi-service-nears-launch",
    "summary": "– The electric vertical takeoff and landing (eVTOL) company Joby Aviation has delivered its first production aircraft to Dubai, where it plans to launch a commercial air taxi service in early 2026. It's a significant milestone for the fledgling air taxi sector, which has been leaning on hype and promises for the future of air travel to attract investors and potential clients. It's a significant milestone for Joby, which has been developing the technology"
  },
  {
    "title": "OpenAI and Microsoft are dueling over AGI. These real-world tests will prove when AI is really better than humans.",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T09:00:01Z",
    "url": "https://www.businessinsider.com/openai-microsoft-duel-agi-real-world-tests-ai-better-humans-2025-6",
    "summary": "– Until OpenAI achieves Artificial General Intelligence (AGI), Microsoft gets a lot of valuable technological and financial benefits from the startup. That's the situation right now: Until OpenAI achieves Artificial General Intelligence, where AI capabilities surpass those of humans, Microsoft gets a lot of valuable technological and financial benefits from the startup. That's the situation right now: Until OpenAI achieves Artificial General Intelligence (AGI), where"
  },
  {
    "title": "Amazon Slashes Dyson V15 Laser Price Twice in 3 Days, Don’t Wait for Prime Day",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T11:10:47Z",
    "url": "https://gizmodo.com/amazon-slashes-dyson-v15-laser-price-twice-in-3-days-dont-wait-for-prime-day-2000621819",
    "summary": "– Amazon has dropped the price of the Dyson V15 cordless vacuum for the second time in a few days, bringing it down to $599. That's a significant cut from its previous list price of $649 and a huge drop from its original $799 list price. The Dyson V15 Detect Plus comes with a powerful motor that delivers up to 100% more power than previous generations, which makes it suitable for deep cleaning your entire home. The"
  },
  {
    "title": "Paul dominates Chavez and calls out big names",
    "source": "BBC News",
    "publishedAt": "2025-06-29T06:31:50Z",
    "url": "https://www.bbc.com/sport/boxing/articles/cvgn9vvnl8zo",
    "summary": "Paul said he was \"embarrassed\" by the boos he received from the crowd at the UFC World Championships in Anaheim."
  },
  {
    "title": "Anker Is Going All In, This 3-Port 65W USB-C Charger Is Almost Free Before Prime Day",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T12:40:47Z",
    "url": "https://gizmodo.com/anker-is-going-all-in-this-3-port-65w-usb-c-charger-is-almost-free-before-prime-day-2000621834",
    "summary": "– Anker's USB-C charger Nano II 65W is one of the most popular models on Amazon, consistently receiving excellent reviews from thousands of users. Right now, it's available at its lowest price ever – just $29, down from the regular $40, just before Prime Day. This deal is available to everyone, not just Prime members. This deal is available to everyone, not just Prime members. See at at Amazon Best Charger in 2025. This deal"
  },
  {
    "title": "1500W Portable Power Station Is Cheaper Than on Black Friday, And You’ll Get a Free 200W Solar Panel Too",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T11:40:03Z",
    "url": "https://gizmodo.com/1500w-portable-power-station-is-cheaper-than-on-black-friday-and-youll-get-a-free-200w-solar-panel-too-2000621824",
    "summary": "– Amazon is kicking off Prime Day deals earlier this year with a bundle that includes the Jackery Explorer 1000 V2 power station and a 200W solar panel for just $698. That's a staggering 46% off the normal bundle price of $1,299. That's a staggering 46% off the normal bundle price of $1,299. That's a staggering 46% off the normal bundle price of $1,299. That'"
  },
  {
    "title": "Is Jake Paul ready for a world title fight? Who is his best option?",
    "source": "ESPN",
    "publishedAt": "2025-06-29T13:38:26Z",
    "url": "https://www.espn.com/boxing/story/_/id/45607165/is-jake-paul-ready-fight-world-title-cruiserweight-best-option",
    "summary": "– Jake Paul won his biggest cruiserweight world title by beating Julio Cesar Chavez Jr. in a 10-round cruiserweight fight in Anaheim, Calif., on Saturday night. The 28-year-old former middleweight champion has made clear his intentions to become a world champion, reports the Los Angeles Times. \"I don't care, bro,\" Paul said during his postfight interview. \"I'm 28 years old. I'll"
  },
  {
    "title": "I spent a week living like it was 1993 — here’s how it went",
    "source": "Android Authority",
    "publishedAt": "2025-06-29T11:00:07Z",
    "url": "https://www.androidauthority.com/living-like-its-1993-3569203/",
    "summary": "– If you've ever wondered what it would be like to live without modern technology for a week, here's how it went. For one week, I lived without modern technology unless it was absolutely necessary for work and emergencies. I carried a Discman, scribbled in a paper planner, and made phone calls instead of texting. I was late. Got up, rushed around, got my kids fed and dressed and off to school"
  },
  {
    "title": "This Ninja 6-in-1 XL Air Fryer Drops to a New Prime Day Low, and It’s Rated 4.7 out of 5",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T13:10:26Z",
    "url": "https://gizmodo.com/this-ninja-6-in-1-xl-air-fryer-drops-to-a-new-prime-day-low-and-its-rated-4-7-out-of-5-2000621842",
    "summary": "– The Ninja DZ401 Foodi 6-in-1 XL air fryer is the best-rated air fryer on Amazon, with over 37,000 reviews and an impressive 4.7 out of 5 stars. The Ninja DZ401 Foodi 6-in-1 XL air fryer is the best-rated air fryer on Amazon, with over 37,000 reviews and an impressive 4.7 out of 5 stars. If you need an XL air fryer that"
  },
  {
    "title": "Open-Source Knob Packed with Precision",
    "source": "Hackaday",
    "publishedAt": "2025-06-29T05:00:50Z",
    "url": "https://hackaday.com/2025/06/28/open-source-knob-packed-with-precision/",
    "summary": "– The Ploopy Knob is a small, compact, and thoughtfully designed control device that uses a magnetic encoder that senses movement with remarkable precision. It's made of 3D-printed case and a USB-C connection, and it's fully open-source. It's available for pre-order on GitHub, and it's available for pre-order at Amazon.com/PloopyKnob. The"
  },
  {
    "title": "MP refers himself to commissioner over 'cash for questions' claims",
    "source": "BBC News",
    "publishedAt": "2025-06-29T11:05:05Z",
    "url": "https://www.bbc.com/news/articles/c4gdrjqvp0jo",
    "summary": "– A Conservative MP has referred himself to a standards commissioner after it was claimed a company he worked for helped him write questions to the government about space data and emissions tracking. George Freeman, 57, has been an MP since 2010 and served as science minister under both Boris Johnson and Rishi Sunak, reports the Sunday Times. In another email, he allegedly asked the company's director \"what to ask about\" when submitting questions about the"
  },
  {
    "title": "Top 5 Essential Toolbox Innovations for Modern DIY and Home Improvement in 2025",
    "source": "Yanko Design",
    "publishedAt": "2025-06-29T11:40:44Z",
    "url": "https://www.yankodesign.com/2025/06/29/top-5-essential-toolbox-innovations-for-modern-diy-and-home-improvement-in-2025/",
    "summary": "– The humble toolbox has become an indispensable companion in nearly every home. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge"
  },
  {
    "title": "Crypto Bros Are Winning Big in Trump’s America",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T13:21:42Z",
    "url": "https://gizmodo.com/crypto-bros-are-winning-big-in-trumps-america-2000621885",
    "summary": "– Donald Trump is back in the White House, and he's making a lot of money in the process, reports the Wall Street Journal. \"I'm president, and what I did there is build an industry that's very important,\" he said during a June 27 press conference. \"I'm president, and what I did there is build an industry that's very important,\" he said. \"It's the kind of thing America"
  },
  {
    "title": "Iran could start enriching uranium for bomb within months, UN nuclear chief says",
    "source": "BBC News",
    "publishedAt": "2025-06-29T06:34:42Z",
    "url": "https://www.bbc.com/news/articles/c79qeqg89g2o",
    "summary": "US strikes on Iran's nuclear sites have caused \"severe but not total\" damage, UN nuclear chief Rafael Grossi has said."
  },
  {
    "title": "The new must-have for CEOs: An AI whisperer",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T08:58:01Z",
    "url": "https://www.businessinsider.com/ceo-ai-whisperer-adviser-2025-6",
    "summary": "– A year ago, Glenn Hopper was advising just a handful of company leaders on how to embed AI agents and tools like ChatGPT throughout their organizations. Today, the Memphis-based AI strategist has an extensive waitlist of C-suite executives seeking his help with those tasks and more, Business Insider reports. \"Everything is inbound,\" said Conor Grennan, chief of AI Mindset, an AI consulting and training firm he founded"
  },
  {
    "title": "Digimon deserves to escape Pokémon’s shadow",
    "source": "Polygon",
    "publishedAt": "2025-06-29T11:26:57Z",
    "url": "https://www.polygon.com/609770/digimon-story-time-stranger-vs-pokemon",
    "summary": "– If you think Digimon are a cheap Pokémon ripoff inspired by a virtual pet toy from the ’90s, you don't know Digimon. Digimon Story: Time Stranger is a new RPG out of Summer Game Fest. Based on early gameplay and reveals, Bandai has at least aimed to produce a game for a wider audience that addresses past mistakes. From investing in making the world of Time Stranger feel"
  },
  {
    "title": "A billion choices",
    "source": "Seths.blog",
    "publishedAt": "2025-06-29T09:30:00Z",
    "url": "https://seths.blog/2025/06/a-billion-choices/",
    "summary": "– If you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a game"
  },
  {
    "title": "Maresca questions US hosting Club World Cup",
    "source": "BBC News",
    "publishedAt": "2025-06-29T05:51:27Z",
    "url": "https://www.bbc.com/sport/football/articles/cx2nq51wd1yo",
    "summary": "Hundreds of teams have been affected by severe weather during the Club World Cup in Charlotte, North Carolina."
  },
  {
    "title": "Skill of the Week: Stack Your Burger Toppings With Maximum Effectiveness",
    "source": "Artofmanliness.com",
    "publishedAt": "2025-06-29T13:54:34Z",
    "url": "https://www.artofmanliness.com/living/food-drink/the-best-order-to-stack-your-burger-toppings/",
    "summary": "– If you're not a fan of burgers, you're in for a treat. Here's how to make a great burger: From bottom to top: Distribute your condiments (mustard, ketchup, mayo, etc.) between the top and bottom buns. This preserves the distinctiveness of their flavors, and prevents an overabundance of goop that will drip and "
  },
  {
    "title": "The CEO building the 'Ikea of factories' wants to democratize semiconductor production",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T09:00:01Z",
    "url": "https://www.businessinsider.com/nanotronics-ceo-interview-semiconductor-fab-factories-local-2025-6",
    "summary": "– Matthew Putman is the CEO of Brooklyn-based Nanotronics, which he cofounded with his father in 2010. Putman, 50, is the CEO of the Brooklyn-based company, which started out building microscopes and tools to detect defects in semiconductors, among other materials. Now, the company builds small, modular semiconductor manufacturing plants called Cubefabs, which measure anywhere from 25,000 square feet for the smallest units up to 10,000 square feet for the largest"
  },
  {
    "title": "When will F1 movie be on Apple TV? Here’s the streaming release date",
    "source": "9to5Mac",
    "publishedAt": "2025-06-29T10:50:31Z",
    "url": "https://9to5mac.com/2025/06/29/f1-movie-when-stream-apple-tv/",
    "summary": "– F1: The Movie is making a big splash in its opening weekend at the box office at movie theaters around the world. But as an Apple production, it will end up streaming on Apple TV+. The movie premiered in theaters in the United States on June 27. After about 45 days, the film will hit its PVOD window; premium video on demand. This means it will be available to buy or rent on digital stores, including Apple TV Store but also"
  },
  {
    "title": "European U21 champions again - but who could make World Cup?",
    "source": "BBC News",
    "publishedAt": "2025-06-29T10:16:49Z",
    "url": "https://www.bbc.com/sport/football/articles/c62gz7w5jpgo",
    "summary": "Those named in Tuchel's squad for the Euro 2023 finals in Slovakia and Senegal are among those who could make the step up from the class of 25 next summer."
  },
  {
    "title": "Chelsea beat Benfica to reach FIFA Club World Cup quarterfinal",
    "source": "Al Jazeera English",
    "publishedAt": "2025-06-29T01:06:07Z",
    "url": "https://www.aljazeera.com/sports/2025/6/29/chelsea-beat-benfica-to-reach-fifa-club-world-cup-quarterfinal",
    "summary": "– The first English side to reach the quarterfinals of the 2025 FIFA Club World Cup after a 4-1 win over Benfica in stoppage time in North Carolina on Saturday was a huge disappointment for the Blues. Reece James scored the opening goal of the game in the 64th minute of stoppage time. Pedro Neto and Kiernan Dewsbury-Hall equalised for Benfica in the fifth minute of stoppage time"
  },
  {
    "title": "Roborock Prime Day Will Be Prime Time to Discover the Incredible New Qrevo and Q Series Robot Cleaners",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T12:20:14Z",
    "url": "https://gizmodo.com/roborock-prime-day-will-be-prime-time-to-discover-the-incredible-new-qrevo-and-q-series-robot-cleaners-2000620442",
    "summary": "– Roborock is rolling out its new Q Series and Q7 M5+ robot cleaners on July 7 for a fraction of the price. The Q7 M5+, Q10 S5+, Qrevo S5V, and QV35A are the latest in a long line of robot cleaners from the brand that brought you the Saros Z70, the world's first mass-produced robot vacuum with a foldable mechanical arm."
  },
  {
    "title": "Crime blotter: Heist indictment, looting charges, and a movie star is robbed",
    "source": "AppleInsider",
    "publishedAt": "2025-06-29T12:00:18Z",
    "url": "https://appleinsider.com/articles/25/06/29/crime-blotter-heist-indictment-looting-charges-and-a-movie-star-is-robbed",
    "summary": "– A New Jersey electronics store owner has been charged with selling more than 100 counterfeit Apple products, the New York Times reports. Mahmoud Salim, 63, of Orange, N.J., is charged with selling more than 100 counterfeit Apple products. Salim is accused of breaking into a Brinks semitruck and stealing \"$100 million worth of gold, diamonds, rubies, emeralds, and luxury watches.\" Salim"
  },
  {
    "title": "Kremlin says Europe will feel the recoil from its 'illegal' sanctions on Russia",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-29T09:50:13Z",
    "url": "https://ca.news.yahoo.com/kremlin-says-europe-feel-recoil-095013464.html",
    "summary": "– Russia's invasion of Ukraine in 2022 triggered a wave of Western sanctions on Russia, and the West said that it hoped its sanctions would force President Vladimir Putin to seek peace in Ukraine, reports Reuters. The Kremlin said in remarks published on Sunday that the tougher the sanctions imposed on Russia by Europe, the more painful the recoil would be for Europe's own economies as Russia had grown resistant to such \"illegal\" sanctions."
  },
  {
    "title": "'Tuipulotu finds feet again and hails world-class Ringrose and Russell'",
    "source": "BBC News",
    "publishedAt": "2025-06-29T09:02:17Z",
    "url": "https://www.bbc.com/sport/rugby-union/articles/cly8g1e5578o",
    "summary": "Sione Tuipulotu feels he's getting his feet back under him after his Test debut against Scotland in Perth."
  },
  {
    "title": "Apple still has some unannounced iOS 26 features in the pipeline: report",
    "source": "9to5Mac",
    "publishedAt": "2025-06-29T12:20:17Z",
    "url": "https://9to5mac.com/2025/06/29/additional-unannounced-ios-26-features-report/",
    "summary": "– Apple still has a few more iOS 26 features in the pipeline, reports the Power On newsletter. These features are live translation via AirPods, as well as syncing captive Wi-Fi connections across your entire Apple ecosystem. Gurman reports that these features weren't announced at WWDC, though they were heavily rumored, and they should still arrive in the coming months. Gurman reports that this is due to the fact that Apple no longer wants to"
  },
  {
    "title": "Concert tickets are wildly expensive. What would it take to actually make them affordable?",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T08:38:01Z",
    "url": "https://www.businessinsider.com/ticket-prices-expensive-cheap-beyonce-taylor-swift-ticketmaster-stubhub-seatgeek-2025-6",
    "summary": "– Ticketmaster, the ticketing giant that merged with Live Nation in 2010, is facing a lawsuit from the Department of Justice, which says it's a monopoly that should be broken up. Live Nation says the lawsuit is a \"performative attempt to grab headlines by asking for a breakup that won't ever happen,\" and it's a \"performative attempt to grab headlines by asking for a breakup that"
  },
  {
    "title": "If You Own an iPhone, Amazon Is Offering a Free AirTag Just Before Prime Day",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T08:28:41Z",
    "url": "https://gizmodo.com/if-you-own-an-iphone-amazon-is-offering-a-free-airtag-prime-day-2000619896",
    "summary": "– AirTags have never been on sale from the Apple website or in Apple stores. Amazon is also running a great deal just in time for Prime Day: purchase three AirTags and receive a fourth free. That drops the price of four AirTags to just $74, down from the regular $99 ($25 each + get one free). That's one of the best deals we've ever seen on these trackers. For the best value, a pack"
  }
]