[
  {
    "title": "Slow-motion humiliation for Starmer as he loses control of Commons",
    "source": "BBC News",
    "publishedAt": "2025-07-02T00:49:04Z",
    "url": "https://www.bbc.com/news/articles/czry6gv80mjo",
    "summary": "– Sir Keir Starmer has a mandate and a majority, but the parallel is this: a government transparently not in control of events, shoved around humiliatingly by parliament. The extraordinary thing about Tuesday's welfare reform vote is it felt, albeit perhaps just fleetingly, like the fraught and chaotic parliamentary rows about Brexit. The astonishing thing about this row is Sir Keir Starmer has a mandate and a majority."
  },
  {
    "title": "Internet Alpha Males Want White America to Fear Zohran Mamdani",
    "source": "Gizmodo.com",
    "publishedAt": "2025-07-02T00:04:04Z",
    "url": "https://gizmodo.com/internet-alpha-males-want-white-america-to-fear-zohran-mamdani-2000623086",
    "summary": "– Zohran Mamdani is facing a digital firestorm from a coalition of conservative commentators, far-right figures, and online alpha male influencers who thrive on having an enemy to attack. The attacks are deeply racialized, overtly Islamophobic, and framed as a battle between \"the West\" and \"the East.\" Mamdani, 33, a Democratic Socialist and state assembly member,"
  },
  {
    "title": "61 Photos From The Past That Are Incredibly Creepy And Unsettling",
    "source": "Boredpanda.com",
    "publishedAt": "2025-07-02T03:00:09Z",
    "url": "https://www.boredpanda.com/terrifying-historical-photos/",
    "summary": "– Photographs from the past aren't as chilling as they used to be, but there's something about the grainy black-and-white film, the stiff poses, and the haunted expressions that make these old photographs feel darker and more mysterious. There's something about the grainy black-and-white film, the stiff poses, and the haunted expressions that makes these old photographs feel darker and more mysterious. It almost feels like"
  },
  {
    "title": "E-waste Dell Inspiron gets turned into the ultimate tabletop arcade rig",
    "source": "Yanko Design",
    "publishedAt": "2025-07-02T00:30:54Z",
    "url": "https://www.yankodesign.com/2025/07/01/e-waste-dell-inspiron-gets-turned-into-the-ultimate-tabletop-arcade-rig/",
    "summary": "– A repurposed Dell Inspiron all-in-one PC has been transformed into a MAME emulation station. Instead of virgin plywood and shiny new components, valkyrie0528 hacked an Xbox 360 controller for reliable input handling and repurposed Logitech desktop speakers for audio. Linux Mint runs the show with Pegasus Frontend handling emulation duties, creating a responsive system that belies its"
  },
  {
    "title": "Is Donald Trump Being Added to Mount Rushmore? Here's the Truth",
    "source": "Eonline.com",
    "publishedAt": "2025-07-02T00:56:41Z",
    "url": "https://www.eonline.com/news/1419375/donald-trumps-face-on-mount-rushmore-why-it-cant-be-added",
    "summary": "– The National Park Service isn't rushing to carve Donald Trump's face on Mount Rushmore, reports the New York Times. The park service says there are no viable locations left for additional carvings due to the lack of stable surfaces on the rockface. \"The carved portion of Mount Rushmore has been thoroughly evaluated,\" the park service tells the New York Times. \"There are no viable locations left for additional carvings,\" a geomechanical engineer tell"
  },
  {
    "title": "Democracy and spiritual practice",
    "source": "Wildmind.org",
    "publishedAt": "2025-07-02T02:55:05Z",
    "url": "https://www.wildmind.org/blogs/on-practice/democracy-and-spiritual-practice",
    "summary": "– I've been writing about how we, as spiritual practitioners, might skillfully face the troubling emotions politics can give rise to. Fear (where is this all going? how bad will things get? how bad will things get?) and despair (mourning the loss of democratic norms). To help me to deal with these potent emotions, I've adopted three slogans: Feet on the ground. Heart wide open. Eyes upward (or keep looking"
  },
  {
    "title": "Real Madrid Sneaks Past Juventus into Club World Cup Quarterfinals",
    "source": "Fox Sports",
    "publishedAt": "2025-07-02T00:04:06Z",
    "url": "https://www.foxsports.com/stories/soccer/real-madrid-sneaks-past-juventus-club-world-cup-quarterfinals",
    "summary": "– Kylian Mbappé made his Club World Cup debut Tuesday as Real Madrid beat Juventus 1-0 in Miami, Fla., thanks to Gonzalo Garcia's second-half header. Gonzalo Garca had started all four of Real Madrid's matches because of a gastrointestinal illness for Mbappé. Garca has started all four of the Spanish club's matches because of a gastrointestinal illness for Mbappé."
  },
  {
    "title": "John Arnold with Dr. Peter Attia — The Greatest Energy Trader of All Time on Lessons Learned, Walking Away from Wall Street, and Reinventing Philanthropy (#818)",
    "source": "Tim.blog",
    "publishedAt": "2025-07-02T02:31:32Z",
    "url": "https://tim.blog/2025/07/01/john-arnold/",
    "summary": "– John Arnold is widely considered the greatest energy trader of all time, and today, through his foundation Arnold Ventures, he's bringing the same rigorous thinking to some of America's toughest social challenges—criminal justice reform, healthcare policy, and K–12 education, to name just a few. In this special episode, Peter sits down with legendary trader John Arnold, widely considered the greatest energy trader of all time, widely considered the greatest"
  },
  {
    "title": "Travis Kelce Says ‘SNL’ Table Read Was A “F***ed Situation” Because He “Can’t Really Read That Well”",
    "source": "Deadline",
    "publishedAt": "2025-07-02T00:07:01Z",
    "url": "http://deadline.com/2025/07/travis-kelce-snl-table-read-1236447387/",
    "summary": "– Travis Kelce is stepping into the acting world and recently recalled a predicament he was put in while guest-hosting Saturday Night Live in 2023. \"The table reading, for a guy that can’t really read that well, it was kind of a fucked situation,\" he said on Bussin’ with the Boys podcast. \"The silly stuff, the funny stuff, the comedy, I just feel so much more comfortable"
  },
  {
    "title": "‘Is It Kind of Douchey? Sure!’ Rob Mac Discusses His Name Change Ahead of It’s Always Sunny in Philadelphia’s Season Premiere",
    "source": "Cracked.com",
    "publishedAt": "2025-07-02T01:27:00Z",
    "url": "https://www.cracked.com/article_47196_is-it-kind-of-douchey-sure-rob-mac-discusses-his-name-change-ahead-of-its-always-sunny-in-philadelphias-season-premiere.html",
    "summary": "– It's always Sunny in Philadelphia's Rob Mac, and now he's officially changing his last name to \"Rob Mac.\" \"The amount of time that I have wasted trying to get people to either say or spell my name is literally days of my life,\" he wrote on Twitter Tuesday. \"Trust me, I added it up.\" \"More importantly, it means thousands of you have had minutes of your lives stolen by me because of my last name"
  },
  {
    "title": "Welcome to Chatsubo - 'Neuromancer' Sci-Fi Series Announcement",
    "source": "First Showing",
    "publishedAt": "2025-07-02T00:52:28Z",
    "url": "https://www.firstshowing.net/2025/chatsubo-neuromancer-scifi-series-announcement/",
    "summary": "– The Neuromancer sci-fi series is now officially in production on Apple TV+. The series stars Callum Turner as Case, a data-thief, Briana Middleton as Molly, a street-samurai, with Joseph Lee as Hideo, Mark Strong as Armitage, Clémence Poésy, Peter Sarsgaard, Emma Laird, plus Max Irons and Dane De"
  },
  {
    "title": "US, Japan, India, Australia announce critical minerals initiative",
    "source": "DW (English)",
    "publishedAt": "2025-07-02T02:47:00Z",
    "url": "https://www.dw.com/en/us-japan-india-australia-announce-critical-minerals-initiative/a-73113459",
    "summary": "– The United States, Japan, India and Australia have announced a critical minerals initiative in Washington, D.C. Tuesday, amid concerns over China's dominance in the field of minerals essential for new technologies. The group, also known as the \"Quad,\" pledged to work towards a stable supply of minerals essential for new technologies. \"Reliance on any one country for processing and refining critical minerals and derivative goods production exposes our industries to economic"
  },
  {
    "title": "Tesla Starting Integration of XAI Grok With Cars in Week or So",
    "source": "Next Big Future",
    "publishedAt": "2025-07-02T00:45:45Z",
    "url": "https://www.nextbigfuture.com/2025/07/tesla-starting-integration-of-xai-grok-with-cars-in-week-or-so.html",
    "summary": "– XAI Grok is being integrated with Tesla cars. Premium connectivity is needed. This will launch in a week or so. Green is working with a testbench. The integration happened with a Tesla software update. This will run on all 2025.20 firmware software systems. This will launch in a week or so. Green is working with a testbench. The integration happened with a Tesla software update. This will run on all 2025"
  },
  {
    "title": "Boy Meets World Stars Discuss The Cory And Shawn Episode They Think Is A ‘Clunker,’ And I Agree With Them",
    "source": "CinemaBlend",
    "publishedAt": "2025-07-02T00:42:53Z",
    "url": "https://www.cinemablend.com/television/boy-meets-world-stars-discuss-cory-and-shawn-episode-they-think-is-clunker",
    "summary": "Pod Meets World was one of the greatest TGIF comedies out there in the ‘90s and early ‘00s . But during its run, there were some bad episodes, including one that the former stars recently deemed to be a clunker . Rider Strong, Danielle Fishel, and Will Friedle discussed not liking on Pod Meets World ."
  },
  {
    "title": "US university bars trans athletes, erases records under pressure from Trump",
    "source": "Al Jazeera English",
    "publishedAt": "2025-07-02T03:03:35Z",
    "url": "https://www.aljazeera.com/news/2025/7/2/us-university-bans-trans-athletes-under-pressure-from-trump-administration",
    "summary": "– The University of Pennsylvania has agreed to bar transgender swimmer Lia Thomas from women's events and erase records set by the transgender swimmer in a civil rights investigation, reports the AP. Thomas, who was born male and came out as a trans woman in 2018, won a National Collegiate Athletic Association Division I title in 2022, becoming the first transgender athlete to do so. The NCAA changed its eligibility rules to limit participation in women'"
  },
  {
    "title": "Jimmy Swaggart Is Dead",
    "source": "Politicalwire.com",
    "publishedAt": "2025-07-02T00:21:39Z",
    "url": "https://politicalwire.com/2025/07/01/jimmy-swaggart-is-dead/",
    "summary": "– \"A fire-and-brimstone Pentecostal preacher, Swaggart bragged he had more followers than Oral Roberts or Jim Bakker, lived a luxuriant life on a 100-acre compound in Baton Rouge, La., and whooshed off to evangelistic crusades in a private jet with a fleet of 18-wheelers, loaded with musical instruments and television equipment,"
  },
  {
    "title": "Nintendo’s Anti-Consumer Anti-Piracy Measures Also Reduce The Value Of The Switch 2",
    "source": "Techdirt",
    "publishedAt": "2025-07-02T03:15:00Z",
    "url": "https://www.techdirt.com/2025/07/01/nintendos-anti-consumer-anti-piracy-measures-also-reduce-the-value-of-the-switch-2/",
    "summary": "– If you're a piracy fan, you're not alone: Nintendo is engaging in copyright protectionism by suspending all kinds of services on its Switch consoles, up to and including bricking it completely. And that's what this protectionism means for the secondary market for Nintendo Switches. As a Reddit user spotted, a Reddit poster bought themselves a preowned Switch 2 from a Walmart store only to"
  },
  {
    "title": "Democrats Want J.D. Vance to Be the Face of the Megabill",
    "source": "Politicalwire.com",
    "publishedAt": "2025-07-02T01:27:53Z",
    "url": "https://politicalwire.com/2025/07/01/democrats-want-j-d-vance-to-be-the-face-of-the-megabill/",
    "summary": "– Democrats are rushing to portray Vice President JD Vance as the central figure behind the passage of the GOP's megabill, Politico reports. \"After 27 hours of debate in the Senate, Vance's Tuesday vote brought the megabill one step closer to President Trump's desk,\" Politico reports. \"Democrats are rushing to portray Vice President JD Vance as the central figure behind the passage of the GOP's megabill,"
  },
  {
    "title": "Dortmund hold off Monterrey to reach Club World Cup quarter-finals",
    "source": "CNA",
    "publishedAt": "2025-07-02T03:08:38Z",
    "url": "https://www.channelnewsasia.com/sport/dortmund-hold-monterrey-reach-club-world-cup-quarter-finals-5215421",
    "summary": "– Borussia Dortmund beat Monterrey 2-1 in the Club World Cup quarter-finals at the Mercedes-Benz Arena in Atlanta, Ga., on Tuesday. Serhou Guirassy and Karim Adeyemi were on the scoresheet in the first half as Dortmund fought back from a late deficit to complete the quarter-finals. Guirassy and Adeyemi were on the scoresheet for Monterrey"
  },
  {
    "title": "Exclusive-Intel's new CEO explores big shift in chip manufacturing business",
    "source": "AOL",
    "publishedAt": "2025-07-02T01:29:32Z",
    "url": "https://www.aol.com/news/exclusive-intels-ceo-explores-big-012932415.html",
    "summary": "– Intel's new chief executive is exploring a big change to its contract manufacturing business to win major customers, two people familiar with the matter told Reuters. The new strategy for Intel's foundry business would mean offering outside customers a newer generation of technology, sources said, in a potentially expensive shift from his predecessor's plans. The new strategy would mean offering outside customers a newer generation of technology, analysts said, in a potentially expensive shift from"
  },
  {
    "title": "IRONHEART's Post-Credits Scene Sets The Stage For Another Supernatural Story - SPOILERS",
    "source": "CBM (Comic Book Movie)",
    "publishedAt": "2025-07-02T02:05:14Z",
    "url": "https://comicbookmovie.com/tv/marvel/ironheart/ironhearts-post-credits-scene-sets-the-stage-for-another-supernatural-story---spoilers-a222538",
    "summary": "– The second half of Ironheart has arrived on Disney+, and it's a pretty confusing stinger that only really confirms there are plans for the characters' stories to continue...somewhere. Ironheart is set after the events of Black Panther: Wakanda Forever, and it's set after the events of Black Panther: Wakanda Forever. It's set after the events of Black Panther: Wakanda For"
  },
  {
    "title": "China’s EDA tool restrictions – winners and losers",
    "source": "TechNode",
    "publishedAt": "2025-07-02T01:58:09Z",
    "url": "http://technode.com/2025/07/02/chinas-eda-tool-restrictions-winners-and-losers/",
    "summary": "– China's electronic design automation (EDA) industry isn't going to be independent of the dominant US- and Europe-produced tools anytime soon. Six years ago, I wrote a two–part article on China's electronic design automation industry. I argued that despite some promising domestic companies, China would not be independent of the US- and Europe-produced tools anytime soon. Six years later, I wrote a two–part article on China's"
  },
  {
    "title": "Judge says DHS can't end protected status for Haitian migrants this year",
    "source": "CBS News",
    "publishedAt": "2025-07-02T02:29:30Z",
    "url": "https://www.cbsnews.com/news/trump-administration-haiti-tps-judge-ruling/",
    "summary": "– The Trump administration can't revoke temporary protected status for hundreds of thousands of Haitian migrants this fall, a federal judge has ruled. Judge Brian Cogan sided with a group of Haitian migrants who sued over the end to TPS for the Caribbean nation, saying Homeland Security Secretary Kristi Noem \"does not have statutory or inherent authority to partially vacate a country's TPS designation.\" Cogan's ruling"
  },
  {
    "title": "Apple Ordered to Pay $110.7 Million Over 3G Patent Infringement",
    "source": "The Mac Observer",
    "publishedAt": "2025-07-02T02:08:19Z",
    "url": "https://www.macobserver.com/news/apple-ordered-to-pay-110-7-million-over-3g-patent-infringement/",
    "summary": "– A federal jury in Delaware has ordered Apple to pay $110.7 million in damages to Spanish technology company TOT Power Control. The jury found that Apple infringed on a key patent related to 3G wireless communication used in devices such as iPhones, iPads, and Apple Watches. The jury found that Apple infringed on a key TOT patent related to 3G wireless communication used in devices such as iPhones, iPads,"
  },
  {
    "title": "Marko opens up about his plans for the near future",
    "source": "F1technical.net",
    "publishedAt": "2025-07-02T00:00:00Z",
    "url": "https://www.f1technical.net/news/27162",
    "summary": "Dr Helmut Marko's Red Bull contract expires at the end of the 2026 season . The 79-year-old Austrian has been Red Bull's motorsport advisor since 1989 . Marko says his focus is on getting the team back on track to win ."
  },
  {
    "title": "D3Publisher Reveals Yuke's' Full Metal Schoolgirl Game",
    "source": "Anime News Network",
    "publishedAt": "2025-07-02T00:03:14Z",
    "url": "https://www.animenewsnetwork.com/news/2025-07-01/d3publisher-reveals-yuke-full-metal-schoolgirl-game/.226174",
    "summary": "– Developer Yuke's is developing a new game titled Full Metal Schoolgirl that will launch on PlayStation 5, Switch 2, and PC via Steam and Epic Games Store on October 23. Full Metal Schoolgirl throws players into a dystopian Japan where the nation's economy is dominated by Meternal Jobz, a corrupt corporate superpower whose zombified cyborg labor force, the \"Working Dead,\" are capable of working non"
  }
]