[
  {
    "title": "Top 5 Robotic Lawnmowers to buy in 2025",
    "source": "Yanko Design",
    "publishedAt": "2025-07-01T01:45:20Z",
    "url": "https://www.yankodesign.com/2025/06/30/top-5-robotic-lawnmowers-to-buy-in-2025/",
    "summary": "– The Lymow One has a tank-style track system that lets this 120-pound beast climb 45-degree slopes, roll over 2-inch obstacles, and traverse terrain that would send conventional wheeled mowers into existential crisis. The Lymow One’s Savage Traverse System employs actual tank-style tracks that let this 120-pound beast climb 45-degree slopes, roll over 2-inch obstacles, and traverse terrain that would send"
  },
  {
    "title": "An American couple sold their house in California and retired in Malaysia. They love 'not owning anything.'",
    "source": "Business Insider",
    "publishedAt": "2025-07-01T00:14:02Z",
    "url": "https://www.businessinsider.com/retired-penang-malaysia-american-couple-affordable-mm2h-long-term-visa-2025-7",
    "summary": "Paul and Ellen Eggers moved to Penang, a state in the northwestern part of Malaysia . In the 1970s, Paul and Ellen Eggers taught in Malaysia as volunteers with the US Peace Corps . The experience left a lasting impression, and decades later, as they prepared to retire, they decided to return ."
  },
  {
    "title": "The Email Startup Graveyard: Why 80%+ of Email Companies Fail",
    "source": "Forwardemail.net",
    "publishedAt": "2025-07-01T00:41:04Z",
    "url": "https://forwardemail.net/en/blog/docs/email-startup-graveyard-why-80-percent-email-companies-fail",
    "summary": "– Forward Email isn't just building email infrastructure from scratch, it's building on top of existing solutions like Amazon SES or open-source systems like Postfix, reports Techstars. It's building on top of existing solutions like Amazon SES or open-source systems like Postfix. The core protocols work well - the challenge is in the implementation. The Infrastructure Reality Check Warning: Every single \"email startup\" is just building UI on top of"
  },
  {
    "title": "Does new 'Cognify' tech allow prisoners to complete years of social rehabilitation in minutes?",
    "source": "Snopes.com",
    "publishedAt": "2025-07-01T01:30:00Z",
    "url": "https://www.snopes.com//news/2025/07/01/new-tech-implant-prisoners-memories/",
    "summary": "– If you're a Snopes reader, you're probably wondering: Is there really a program giving prisoners a choice to either serve their sentences or allow their memory to be wiped out with a process called Cognify? Snopes readers have been asking about a supposed new technology known as \"Cognify\" that is changing how criminals are incarcerated. \"Is there really a program giving prisoners "
  },
  {
    "title": "McLaren Offers Ultra-Rare Chance to Own a 2027 Le Mans Hypercar",
    "source": "HYPEBEAST",
    "publishedAt": "2025-07-01T00:59:56Z",
    "url": "https://hypebeast.com/2025/6/mclaren-project-endurance-2027-le-mans-hypercar-info",
    "summary": "– McLaren and McLaren Racing have launched Project: Endurance, a rare customer partnership program that offers a select few the chance to own a 2027 McLaren Le Mans Hypercar. The two-year global track experience includes access to world-class circuits, personalized coaching and full pit support, with access to world-class circuits, personalized coaching and full pit support. Only a limited number of these authentic race cars will be produced"
  },
  {
    "title": "Trump global aid cuts risk 14 million deaths in five years, report says",
    "source": "BBC News",
    "publishedAt": "2025-07-01T01:55:32Z",
    "url": "https://www.bbc.com/news/articles/cx2jjpm7zv8o",
    "summary": "– Donald Trump's move to cut most of the US funding towards foreign humanitarian aid could cause more than 14 million deaths in five years, according to a report published in the Lancet medical journal. A third of those at risk of premature deaths were children, according to a report by a Barcelona Institute for Global Health. The report says the cuts \"risk abruptly halting - and even reversing - two decades of progress in health among vulnerable populations"
  },
  {
    "title": "The fraud epidemic demands a smarter response",
    "source": "Retailbankerinternational.com",
    "publishedAt": "2025-07-01T03:08:29Z",
    "url": "https://www.retailbankerinternational.com/comment/fraud-epidemic-demands-smarter-response-jason-blackhurst/",
    "summary": "– In the US, fraud losses reached $12.5bn in 2024, surpassing the $10.3bn figure in 2023 by over $2bn. UK Finance’s 2024 Fraud report highlighted that almost £1.2bn was lost to fraud in the US in 2023, surpassing the $10.3bn figure in 2023 by over $2bn. But more than those eye-watering financial losses, the losses also lead to erosion of trust and confidence"
  },
  {
    "title": "Grandfather of suspect in deadly Idaho firefighter ambush speaks out",
    "source": "ABC News",
    "publishedAt": "2025-07-01T00:21:24Z",
    "url": "https://abcnews.go.com/US/grandfather-suspect-deadly-idaho-firefighter-ambush-speaks/story?id=123358271",
    "summary": "– Two people are dead after a gunman ambushed two firefighters in Coeur d'Alene, Idaho, on Sunday, officials said. Wess Roley, the suspected gunman in the ambush, was found dead on Canfield Mountain after an hourslong manhunt with a shotgun nearby, the Kootenai County Sheriff's Office said. Officials believe he shot himself after the attack. \"Nobody wants to think"
  },
  {
    "title": "Who was Oscar V. Peterson, the man replacing gay rights icon Harvey Milk on a U.S. Navy ship?",
    "source": "Advocate.com",
    "publishedAt": "2025-07-01T01:31:26Z",
    "url": "https://www.advocate.com/news/oscar-peterson-replaces-harvey-milk",
    "summary": "– Oscar Verner Peterson, a World War II hero and Congressional Medal of Honor recipient, was a World War II hero and posthumously awarded the Medal of Honor, the nation's highest military decoration. Peterson was chief watertender on USS Neosho, an oil tanker, when it was fired on by Japanese planes during the battle of the Coral Sea in 1942. He was seriously wounded in the attack, as were most of his"
  },
  {
    "title": "Clint Eastwood Almost Starred In A Will Smith Sci-Fi Box Office Hit",
    "source": "/FILM",
    "publishedAt": "2025-07-01T03:00:00Z",
    "url": "https://www.slashfilm.com/1896427/clint-eastwood-will-smith-sci-fi-box-office-hit-men-in-black/",
    "summary": "– Clint Eastwood isn't the only Hollywood star to make a name for himself in the world of film and television, but he's still at the top of his game, reports the Hollywood Reporter. The 94-year-old has been a part of all sorts of genre work, from psychological thrillers (\"Play Misty For Me\") to revisionist Westerns (\"Unforgiven\") and everything in between. He's "
  },
  {
    "title": "Real Madrid's Kylian Mbappé eyes Club World Cup debut after illness",
    "source": "Fox Sports",
    "publishedAt": "2025-07-01T00:12:53Z",
    "url": "https://www.foxsports.com/stories/soccer/kylian-mbappe-is-a-big-possibility-to-make-club-world-cup-debut-on-tuesday-against-juventus",
    "summary": "– Kylian Mbappé could make his Club World Cup debut when Real Madrid faces Juventus in the round of 16 on Tuesday, coach Xabi Alonso said Monday. \"I don’t know how much, but a big possibility,\" Alonso said at the Hard Rock Stadium. \"I don’t know how much, but a big possibility,\" he said. \"I don’t know how much, but a big possibility,\" he"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,223",
    "source": "Al Jazeera English",
    "publishedAt": "2025-07-01T03:24:41Z",
    "url": "https://www.aljazeera.com/news/2025/7/1/russia-ukraine-war-list-of-key-events-day-1223",
    "summary": "– Russian forces have taken control of the eastern Ukrainian city of Luhansk, which is one of four that Russia now claims as its own. If confirmed, that would make Luhansk the first Ukrainian region fully occupied by Russia after more than three years of war. If confirmed, that would make Luhansk the first Ukrainian region fully occupied by Russia after more than three years of war. Russia's state media and war bloggers also said that Russian forces have"
  },
  {
    "title": "World Market Minis Make the Perfect Gift!",
    "source": "Hip2save.com",
    "publishedAt": "2025-07-01T03:10:54Z",
    "url": "https://hip2save.com/deals/world-market-gifts/",
    "summary": "– If you're looking for a unique, or even personalized gift, head to World Market instead! You can score an extra 15% off your purchase when you sign up for World Market Rewards (free to join), plus, through August 6th, current rewards members can save 10% off their pick-up order with promo code STORE10 at checkout. Shipping is free on orders of $49+, or opt for free in-store pickup where available. Note that some of"
  },
  {
    "title": "Trump administration freezes $6.8 billion in federal education funds; California hit hard",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-01T03:22:05Z",
    "url": "https://www.yahoo.com/news/trump-administration-freezes-6-8-032205370.html",
    "summary": "– The Trump administration on Monday moved to withhold a projected $6.8 billion in education funds — including at least $811 million from California — including money appropriated by Congress to help students who are learning English and those who are from migrant families, as well as funds to boost teacher training, after-school programs and classroom technology. \"This illegal action will harm students starting now,\" said state Supt. of Public Instruction Tony Thurmond. \"This illegal"
  },
  {
    "title": "White House says Canada's Carney 'caved' to Trump on tech tax",
    "source": "BBC News",
    "publishedAt": "2025-07-01T02:39:24Z",
    "url": "https://www.bbc.com/news/articles/cd0vv2pe7ydo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "summary": "Canadian Prime Minister Mark Carney met US President Donald Trump at the White House in May, calling the digital services tax a \"blatant attack\"."
  },
  {
    "title": "How to use a spare keyboard or numpad as a macropad in macOS",
    "source": "AppleInsider",
    "publishedAt": "2025-07-01T03:13:36Z",
    "url": "https://appleinsider.com/inside/macos/tips/how-to-use-a-spare-keyboard-or-numpad-as-a-macropad-in-macos",
    "summary": "– The Elgato Stream Deck is great for running macros on your Mac, but there are ways to do it significantly cheaper. The Elgato Stream Deck is handy, but can be expensive. The Elgato Stream Deck is great for running macros on your Mac, but there are ways to do it significantly cheaper. The Logitech MX Creative Console is $149 on Amazon, while the Stream Deck Neo is $96 with eight buttons, and"
  },
  {
    "title": "The Hoover Institution on Understanding the Effects of Technology on Economics and Governance | June 2025",
    "source": "Hoover.org",
    "publishedAt": "2025-07-01T00:00:00Z",
    "url": "https://www.hoover.org/hoover-institution-understanding-effects-technology-economics-and-governance-june-2025",
    "summary": "– The US is losing its human capital edge in the AI competition, according to a new study from the Hoover Institution Briefing on the Effects of Technology on Economics and Governance. According to the study, the US cannot rely on export controls alone to constrain future Chinese AI development, because the US is starting to lose its human capital edge in the AI competition as well, writes Amy Zegart. \"The success of DeepSeek should act as an early-warn"
  },
  {
    "title": "How The Composer of 'The Day The Earth Blew Up: A Looney Tunes Movie' Scores Zany Cartoons",
    "source": "Nofilmschool.com",
    "publishedAt": "2025-07-01T00:09:58Z",
    "url": "https://nofilmschool.com/joshua-moshier-composter",
    "summary": "– The Day The Earth Blew Up is the first fully-animated Looney Tunes film to hit theaters, and Joshua Moshier's score is a constant and dynamic presence throughout the 90-minute film. Moshier's score draws inspiration from Carl Stalling's original compositions while also embracing the film's sci-fi setting. \"When I started writing to picture, I wrote two suites of themes, inspired by some early footage"
  },
  {
    "title": "Star Trek, a Basement, and a Broken Spine: The Origin Story of Hollywood’s Favorite Editing Software, Avid",
    "source": "Nofilmschool.com",
    "publishedAt": "2025-07-01T00:06:06Z",
    "url": "https://nofilmschool.com/star-trek-a-basement-and-a-broken-spine-the-origin-story-of-hollywoods-favorite-editing-software-avid",
    "summary": "– Bill Warner and Eric Peters were working on a video editing project for a computer company in Boston in 1988 when they ran into a problem. Warner had been working there for 4 years when he ran into a problem. The company asked him to cut a promo video for their high-performance workstations, and he figured, how hard could it be? Write the script, shoot footage, and maybe borrow an editor for a few hours."
  },
  {
    "title": "Kilmar Abrego Garcia's release delayed after lawyers warn of possible deportation",
    "source": "CBS News",
    "publishedAt": "2025-07-01T02:11:17Z",
    "url": "https://www.cbsnews.com/news/kilmar-abrego-garcia-release-delayed-federal-custody/",
    "summary": "– Kilmar Abrego Garcia, a Salvadoran man who was mistakenly deported to El Salvador and then returned to the U.S. to face human smuggling charges, will remain in federal custody until at least mid-July, a federal magistrate judge said Monday. Abrego Garcia's lawyers had asked the judge to delay his release, warning that the Trump administration had made conflicting statements about whether he will be de"
  },
  {
    "title": "Nike Air Max Moto 2k Wmns Light Violet Ore / Metallic Silver",
    "source": "KicksOnFire.com",
    "publishedAt": "2025-07-01T02:02:10Z",
    "url": "https://www.kicksonfire.com/nike-air-max-moto-2k-wmns-light-violet-ore-metallic-silver",
    "summary": "– The Nike Air Max Moto 2K WMNS in Light Violet Ore and Metallic Silver is a stunning blend of modern design and classic Nike innovation, tailored specifically for women who value both style and performance. The shoe encapsulates the signature air cushioning technology that Nike is famed for, providing unparalleled comfort and responsiveness with each step. The Light Violet Ore colorway offers a subtle yet distinct palette, making it both versatile and chic for any casual or athletic"
  },
  {
    "title": "Super8 Camera Brought to the Modern World",
    "source": "Hackaday",
    "publishedAt": "2025-07-01T02:00:12Z",
    "url": "https://hackaday.com/2025/06/30/super8-camera-brought-to-the-modern-world/",
    "summary": "– If you're a fan of the 80s, then you'll love this retrofitting of a Canon 514XL-S to a Raspberry Pi Zero 2W and a Camera Module 3, reports the New York Times. The Raspberry Pi Zero 2W is made of a small number of components, including the trigger mechanism, which makes it look like it's filmed on an analog medium 40 years ago. It's also a good"
  },
  {
    "title": "Saucony Progrid Omni 9 Green Glowaconstrictor",
    "source": "KicksOnFire.com",
    "publishedAt": "2025-07-01T02:47:53Z",
    "url": "https://www.kicksonfire.com/saucony-progrid-omni-9-green-glowaconstrictor",
    "summary": "– The Saucony Progrid Omni 9 Green Glowaconstrictor is a running shoe that has captured the attention of athletes and fitness enthusiasts with its combination of support, style, and innovative technology. Known for its remarkable stability features, the shoe utilizes Saucony's ProGrid cushioning technology, which spans the length of the shoe to absorb impact and offer a responsive, smooth ride. This technology not only enhances comfort but also helps"
  },
  {
    "title": "Asics Gel-kayano 20 Glacier / Lite Mint",
    "source": "KicksOnFire.com",
    "publishedAt": "2025-07-01T02:39:37Z",
    "url": "https://www.kicksonfire.com/asics-gel-kayano-20-glacier-lite-mint",
    "summary": "– The Asics Gel-Kayano 20 Glacier/Lite Mint is a running shoe that combines advanced technology with stylish design. The \"Glacier/Lite Mint\" colorway adds a fresh aesthetic to the classic design, featuring a subtle blend of soft blue tones complemented by mint accents. The shoe boasts a signature FluidRide midsole for optimal cushioning and bounce-back, ensuring smooth transition"
  },
  {
    "title": "Nintendo Music Update Adds Another Mario Album, Here's Every Song Included",
    "source": "Nintendo Life",
    "publishedAt": "2025-07-01T01:30:00Z",
    "url": "https://www.nintendolife.com/news/2025/07/nintendo-music-update-adds-another-mario-album-heres-every-song-included",
    "summary": "– New Super Mario Bros. U Deluxe is the latest to join the Nintendo Music mobile app for Switch Online subscribers. The soundtrack, based on the 2019 Switch version, comes loaded with 90 tracks and has a total runtime of 2 hours and 7 minutes. You can listen to everything from the title screen through to the catchy staff credits. You'll be able to listen to everything from the title screen through to the catchy staff credits. You'll be "
  },
  {
    "title": "fromis_9 Announces U.S. Stops For 2025 World Tour “NOW TOMORROW.”",
    "source": "soompi",
    "publishedAt": "2025-07-01T02:28:52Z",
    "url": "http://www.soompi.com/article/1756356wpp/fromis_9-announces-u-s-stops-for-2025-world-tour-now-tomorrow",
    "summary": "– Fromis_9 is heading to the U.S. for their 2025 K-pop tour, which kicks off on August 26 in New York City. The group will then travel to seven cities in the United States, including Washington D.C., Chicago, Phoenix, Los Angeles, Oakland, and Seattle on September 8. Check out the full list of dates and venues below!"
  },
  {
    "title": "Death Stranding's 600-Page Novelization Is Free On Audible",
    "source": "GameSpot",
    "publishedAt": "2025-07-01T00:02:00Z",
    "url": "https://www.gamespot.com/articles/death-strandings-600-page-novelization-is-free-on-audible/1100-6532805/",
    "summary": "– The Death Stranding novel is now available in audiobook format at Audible.com, or as audiobooks narrated by actor Bronson Pinchot (Perfect Strangers, Beverly Hills Cop). Both volumes are available in paperback and Kindle format, or as audiobooks narrated by actor Bronson Pinchot. The books are included in the Audible Premium library available to Audible Premium and Premium Plus subscribers, so Audible"
  },
  {
    "title": "The Hoover Institution Briefing On National Security | May 2025",
    "source": "Hoover.org",
    "publishedAt": "2025-07-01T00:00:00Z",
    "url": "https://www.hoover.org/news/hoover-institution-briefing-national-security-may-2025",
    "summary": "– Drones and AI: The Partnership Between Drones and AI Hargrove Hoover Fellow Jacquelyn Schneider's new book, The Hand Behind Unmanned: Origins of the U.S. Autonomous Military Arsenal, is gaining attention and reviews. The book traces the history of the unmanned military arsenal to its most current stage of development and looks beyond, to the progress in moving from unmanned to \"unhumanned\" in order"
  },
  {
    "title": "Meta Gives Huge AI Salaries and Offering Billions for AI Companies",
    "source": "Next Big Future",
    "publishedAt": "2025-07-01T02:16:19Z",
    "url": "https://www.nextbigfuture.com/2025/06/meta-gives-huge-ai-salaries-and-offering-billions-for-ai-companies.html",
    "summary": "– Meta just hired at least eight top OpenAI AI researchers to build out its new \"superintelligence\" team. The company has about 15-20 AI researchers from OpenAI and Google Gemini. Many are getting $100 million signing bonuses and $10+ million per year in salary. Many are getting $100 million signing bonuses and $10+ million per year in salary. Many are getting $100 million signing bonuses and $10+ million per year in salary. There are terms to those agreements in terms of what has to"
  }
]