[
  {
    "title": "AI Might Kill Us All (With Carbon Emissions)",
    "source": "Hackaday",
    "publishedAt": "2025-07-04T02:00:04Z",
    "url": "https://hackaday.com/2025/07/03/ai-might-kill-us-all-with-carbon-emissions/",
    "summary": "– If you're a big fan of artificial intelligence (AI), you're not alone. A new study from the MIT Technology Review finds that data center power usage is 48% more carbon intensive than the US average already, and it's likely going to rise as new data centers push for increased fossil fuel usage, the AP reports. The study found that if data centers cut their electricity use by roughly half for just a few hours during the year, it"
  },
  {
    "title": "Linkind EP6 Smart Hexagon Panel Lights Review: Lighting That Communicates",
    "source": "Yanko Design",
    "publishedAt": "2025-07-04T01:45:29Z",
    "url": "https://www.yankodesign.com/2025/07/03/linkind-ep6-smart-hexagon-panel-lights-review-lighting-that-communicates/",
    "summary": "– The Linkind EP6 is a smart lighting system that lets you paint your walls with light, transforming ordinary spaces into dynamic, mood-responsive environments. But can it truly deliver on these promises? We mounted these hexagonal panels on our wall to see if it can truly deliver on these promises. The design language of the Linkind EP6 is sleek, minimalist design language featuring clean lines and premium surface treatments, presenting itself as subtle geometric wall elements rather than obvious technology"
  },
  {
    "title": "Ari Aster Talks “Very Frightening” Future Of AI As Some Treat The Tech “As A God”",
    "source": "Deadline",
    "publishedAt": "2025-07-04T01:02:24Z",
    "url": "http://deadline.com/2025/07/ari-aster-very-frightening-future-ai-1236449522/",
    "summary": "– Eddington writer Ari Aster says he has \"a lot of fear\" regarding the growing use of AI in the industry and how some treat it \"as a god.\" \"It’s obviously already too late. We’re in a race now,\" he tells Deadline. \"I see AI-generated videos, and they look like life; they just look real,\" he says. \"I see AI-generated videos, and they look"
  },
  {
    "title": "'Googling' can stifle creativity, according to new research",
    "source": "New Atlas",
    "publishedAt": "2025-07-04T02:37:03Z",
    "url": "https://newatlas.com/medical/internet-access-creativity-fixation-effect/",
    "summary": "– A new study by Carnegie Mellon University examines the impact of internet access on creativity. The study examined whether being able to \"Google\" something helped or hindered a person's ability to come up with creative ideas, reports the New York Times. The researchers were asked to randomly assign students to conditions with or without access to Google. They were randomly assigned to conditions with or without access to Google, and the results were compared to a sample of "
  },
  {
    "title": "Kubernetes is a symptom, not a solution",
    "source": "Andreafortuna.org",
    "publishedAt": "2025-07-04T00:42:27Z",
    "url": "https://andreafortuna.org/2025/06/20/unpopular-opinion-kubernetes-is-a-symptom-not-a-solution",
    "summary": "– Kubernetes is one of the biggest hurdles to real innovation in cloud computing today, and that's why I asked an AI to write a brutally honest, no-holds-barred critique of Kubernetes: \"Make it controversial.\" \"Make it provocative. Really lean into the contrarian takes,\" he wrote, per the Wall Street Journal. \"Make it provocative. Really lean into the contrarian takes.\""
  },
  {
    "title": "Cruise Passenger Went on a Solo Hike In Alaska. When It Was Time to Reboard, They Were Nowhere to Be Found",
    "source": "PEOPLE",
    "publishedAt": "2025-07-04T00:02:04Z",
    "url": "https://people.com/cruise-passenger-disappears-while-hiking-alone-in-alaska-11766629",
    "summary": "– Marites Buenafe, 62, is missing after embarking on a solo hike in Alaska. The Kentucky native texted her family to say she was heading up the Mount Roberts Tramway with plans to hike Gold Ridge to Gastineau Peak, according to a bulletin from the Alaska State Troopers. When she didn't return to the cruise ship by all-aboard time, she was reported missing to local state troopers,"
  },
  {
    "title": "Beware the New Eugenics",
    "source": "Newgeography.com",
    "publishedAt": "2025-07-04T00:28:38Z",
    "url": "http://www.newgeography.com/content/008595-beware-new-eugenics",
    "summary": "– Eugenics, a policy that seeks to \"improve\" humanity, has long been embraced by both the Left and Right, but its beating heart lies not in politics, but in tech-driven approaches that transcend conventional politics. From \"gene editing\" to in-vitro birthing and cloning, eugenics offers new ways to create \"the better human,\" the New York Times reports. \"In a way that past"
  },
  {
    "title": "Brand USA CEO: Budget Bill Means 'Significant Recalibration of Operations'",
    "source": "Skift",
    "publishedAt": "2025-07-04T00:05:46Z",
    "url": "http://skift.com/2025/07/03/brand-usa-ceo-budget-bill-means-significant-recalibration-of-operations/",
    "summary": "– Brand USA hasn't received any federal matching funds since January, an unusually long dry spell compared with past presidential administrations, reports the Wall Street Journal. Brand USA hasn't received any federal matching funds since January, and international visits to the U.S. have been down for most of 2025, and still haven't reached pre-Covid levels, reports the Wall Street Journal. Brand USA's CEO, Fred Dixon, said he"
  },
  {
    "title": "Flavor Flav Says U.S. Needs To Ban Guns, 'I Fear For My Kids'",
    "source": "TMZ",
    "publishedAt": "2025-07-04T00:06:23Z",
    "url": "https://www.tmz.com/2025/07/03/flavor-flav-gun-ban-op-ed/",
    "summary": "– Flavor Flav is calling for the United States to ban all firearms in an op-ed in Newsweek. The rapper says the country is caught in a \"epidemic of gun violence with no sign we can stop or change course.\" Flav says he fears for his kids when he drops them off at school, and that school shootings are so common they have become normalized. \"Our schools aren't safe and our"
  },
  {
    "title": "“Bro retired from fighting grandpas”: Jake Paul has officially been given a world boxing ranking",
    "source": "The Daily Dot",
    "publishedAt": "2025-07-04T02:30:00Z",
    "url": "https://www.dailydot.com/news/jake-paul-boxing-world-ranking/",
    "summary": "– Jake Paul, the content creator turned boxer, has been ranked as the fourteenth best Cruiserweight in the world, reports the New York Times. Paul, who started boxing in 2018, was known for being a YouTuber and for being embroiled in several controversies, including accusations of racism, public nuisance lawsuits, and allegations of \"scamming\" his fans. But he's now a boxer, and he"
  },
  {
    "title": "USA vs. Mexico: Why Christian Pulisic And Other Stars Aren't At The Gold Cup",
    "source": "Fox Sports",
    "publishedAt": "2025-07-04T00:24:03Z",
    "url": "https://www.foxsports.com/stories/soccer/why-christian-pulisic-gio-reyna-other-u-s-stars-wont-play-vs-mexico",
    "summary": "– The U.S. men's national team will face Mexico in Sunday's 2025 Concacaf Gold Cup final, and it's going to be without some of their biggest and brightest players. Christian Pulisic isn't with the U.S. after deciding to sit out of the tournament after two seasons in Europe with AC Milan. \"I fully respect that. I didn't understand that. I didn't understand it, but"
  },
  {
    "title": "Amazon Hits 1 Million Robots, Should Human Workers Be Worried?: Company Says 'Creating New Career Opportunities'",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-04T01:31:12Z",
    "url": "https://finance.yahoo.com/news/amazon-hits-1-million-robots-013112699.html",
    "summary": "– Amazon recently celebrated its one millionth robot in operations, a significant new milestone hit since 750,000 in early 2024. Along with the milestone, Amazon also announced its new generative AI foundation model that will improve robot fleet travel efficiency by 10%. \"Think of DeepFleet as an intelligent traffic management system for a city filled with cars moving through congested streets,\" said Amazon Robotics Vice President Scott Dresser. \"We've just deployed our"
  },
  {
    "title": "What Is 'Dos a Cero'? A History Of The USA-Mexico Rivalry's Signature Scoreline",
    "source": "Fox Sports",
    "publishedAt": "2025-07-04T00:25:56Z",
    "url": "https://www.foxsports.com/stories/soccer/what-dos-cero-history-usa-mexico-rivalrys-signature-scoreline",
    "summary": "– Dos a Cero is a Spanish word for \"two to zero\" in the USA-Mexico men's soccer rivalry, and it's been around since 1934, when the U.S. won 4-2 in a World Cup qualifying match in Rome, but Mexico's dominance shifted toward a more competitive rivalry since the turn of the century. The 2-0 scoreline, which means \"Two to Zero,\" is"
  },
  {
    "title": "Windows_EndPoint_Audit – Endpoint Security Auditing Toolkit",
    "source": "Darknet.org.uk",
    "publishedAt": "2025-07-04T01:00:00Z",
    "url": "https://www.darknet.org.uk/2025/07/windows_endpoint_audit-endpoint-security-auditing-toolkit/",
    "summary": "– ITAuditMaverick is a powerful tool for offensive security professionals and red teams to examine endpoint configurations for misconfigurations, weak permissions, and forensic artefacts. The toolkit is implemented in PowerShell and designed to run with minimal dependencies on standard Windows systems. It performs targeted audits of configurations, enabling identification of: Unsecured service registrations World-readable or writable registry"
  },
  {
    "title": "The Return Trends At Spritzer Bhd (KLSE:SPRITZER) Look Promising",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-04T00:21:55Z",
    "url": "https://finance.yahoo.com/news/return-trends-spritzer-bhd-klse-002155295.html",
    "summary": "– Spritzer Bhd (KLSE:SPRITZER) is a tech company that's working to make quantum computing a reality. The company's return on capital employed (ROCE) is a measure of a company's yearly pre-tax profit (its return) relative to the capital employed in the business, which is a trait of a compounding machine. Spritzer Bhd has an ROCE of 15%,"
  },
  {
    "title": "Neto grieves Jota's death as Chelsea face Palmeiras in Club World Cup",
    "source": "CNA",
    "publishedAt": "2025-07-04T01:14:51Z",
    "url": "https://www.channelnewsasia.com/sport/neto-grieves-jotas-death-chelsea-face-palmeiras-club-world-cup-5219866",
    "summary": "– Pedro Neto will decide whether to play for Chelsea in Friday's Club World Cup quarter-final against Palmeiras, reports the BBC. The Portuguese forward is mourning the death of his close friend and teammate Diogo Jota, who was killed in a car accident in northwestern Spain on Thursday morning. Neto was excused from training but chose to remain with the squad in Philadelphia, reports the BBC. \"It’s a difficult moment"
  },
  {
    "title": "New managers making instant impact as Club World Cup quarter-finals take shape",
    "source": "CNA",
    "publishedAt": "2025-07-04T01:12:28Z",
    "url": "https://www.channelnewsasia.com/sport/new-managers-making-instant-impact-club-world-cup-quarter-finals-take-shape-5219861",
    "summary": "– It's been a long time since Manchester City and Pep Guardiola were beaten in the 2023 soccer Club World Cup final by Al Hilal, and now three of the eight quarter-finalists have stepped up their managerial responsibilities. Simone Inzaghi's Al Hilal side stunned Pep Guardiola's Manchester City 4-3 in extra-time in a stunning extra-time thriller, reports the BBC. Inzaghi, who left Inter"
  },
  {
    "title": "CBS News poll on why Americans fly the flag",
    "source": "CBS News",
    "publishedAt": "2025-07-04T00:00:07Z",
    "url": "https://www.cbsnews.com/news/cbs-news-poll-on-why-americans-fly-the-flag/",
    "summary": "– Many Americans will fly the flag, they will do so out of patriotism, and seeing the flag connotes the same feeling. As July 4 nears, here's something a lot of Americans agree on: Many will fly the flag, they will do so out of patriotism, and seeing the flag connotes the same feeling. But for those who do feel they've seen the flag used in these contexts, it's more"
  },
  {
    "title": "Boiling in Brussels: Climate fights and Orbán vs. Pride",
    "source": "POLITICO.eu",
    "publishedAt": "2025-07-04T02:00:00Z",
    "url": "https://www.politico.eu/podcast/eu-confidential/boiling-in-brussels-climate-fights-and-orban-vs-pride/",
    "summary": "– The EU's new 2040 climate target is a long-delayed goal, and it's already being softened, reports POLITICO Climate Reporter Louise Guillot, Chief Foreign Affairs Correspondent Nick Vinocur, and EU Politics Reporter Max Griera. POLITICO Climate Reporter Louise Guillot, Chief Foreign Affairs Correspondent Nick Vinocur, and EU Politics Reporter Max Grier"
  },
  {
    "title": "Winona's Jake Timm finding his footing with World of Outlaws",
    "source": "PostBulletin.com",
    "publishedAt": "2025-07-04T00:03:00Z",
    "url": "https://www.postbulletin.com/sports/gopher-50-notebook-winonas-timm-finding-his-footing-with",
    "summary": "– Jake Timm, the son of local Modified racing star Bob Timm, won his first heat race of the season at I-55 Federated Auto Parts Raceway in Pevely, Mo., on June 21. That translated into a front-row starting spot and a season-best ninth-place finish in the A Main for Timm, who sits third in the World of Outlaws Late Models Rookie of the Year points standings"
  },
  {
    "title": "In Matt Tyrnauer’s ‘Nobu,’ A Master Sushi Chef Creates A Luxury Empire In Collab With Robert De Niro, Meir Teper",
    "source": "Deadline",
    "publishedAt": "2025-07-04T00:42:20Z",
    "url": "http://deadline.com/2025/07/nobu-documentary-director-matt-tyrnauer-interview-1236449490/",
    "summary": "– Chef Nobu Matsuhisa's rise from neophyte sushi chef to heart of empire of restaurants and hotels is traced in the new documentary Nobu, directed by Matt Tyrnauer. \"Nobu, who had a lot of tragedy and repeated failure, didn't really become successful until he was almost 40,\" Tyrnauer tells Deadline. \"He was, in fact, quite the opposite of successful. He was "
  },
  {
    "title": "Sabah attracts growing interest from Kazakhstan in tourism and business",
    "source": "The Star Online",
    "publishedAt": "2025-07-04T02:44:00Z",
    "url": "https://www.thestar.com.my/news/nation/2025/07/04/sabah-attracts-growing-interest-from-kazakhstan-in-tourism-and-business",
    "summary": "– Kazakhstan is showing increasing interest in Sabah as both a tourist destination and an investment hub, the Asean Chamber of Commerce and Industry (ACCI) Sabah chapter president Datuk Nordin Ening says. \"There are encouraging signs that Sabah could play a bigger role in attracting Kazakh tourists and investors,\" he said. \"There are encouraging signs that Sabah could play a bigger role in attracting Kazakh tourists and investors,\" he"
  },
  {
    "title": "3 ASX Penny Stocks With Market Caps Over A$70M",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-04T03:04:50Z",
    "url": "https://finance.yahoo.com/news/3-asx-penny-stocks-market-030450845.html",
    "summary": "– Australian penny stocks continue to capture investor interest for their potential growth opportunities at accessible price points, reports the Wall Street Journal. The top 10 penny stocks in Australia are Alfabs Australia (ASX:AAL) A$0.37 A$106.04M, Bisalloy Steel Group (ASX:BIS) A$3.75 A$177.94M, CTI Logistics (ASX:CLX) A$1.80 A$144.98"
  },
  {
    "title": "The History and Evolution of Probe Lenses: From Innovation to Cinematic Excellence",
    "source": "Newsshooter",
    "publishedAt": "2025-07-04T02:05:00Z",
    "url": "https://www.newsshooter.com/2025/07/03/the-history-and-evolution-of-probe-lenses-from-innovation-to-cinematic-excellence/",
    "summary": "– The probe lens revolutionized macro cinematography when it came to capturing ultra-close-up shots in confined spaces. In 1993, Australian cinematographer Jim Frazier patented the Frazier lens system, which revolutionized macro cinematography by allowing ultra-close-up shots in confined spaces without losing detail. Frazier's system was licensed for production and distribution by the renowned camera manufacturer Panavision, and was used in a variety of"
  },
  {
    "title": "Trinity Rodman Cheered on Ben Shelton at Wimbledon",
    "source": "The Cut",
    "publishedAt": "2025-07-04T01:03:35Z",
    "url": "http://www.thecut.com/article/trinity-rodman-ben-shelton-wimbledon.html",
    "summary": "– The USWNT soccer star and Ben Shelton are getting more serious. Months after hard-launching their relationship on Instagram, Trinity Rodman, the daughter of former NBA player Dennis Rodman, has been spotted cheering on her boyfriend at Wimbledon. \"I mean, I’m just another person in a relationship and people know about it,\" she tells ESPN's SportsCenter. \"I’m obviously very happy and hopefully some of the world's happy"
  },
  {
    "title": "LHDN identifies 845 cases for action under Ops Tanjong in Penang",
    "source": "The Star Online",
    "publishedAt": "2025-07-04T00:03:00Z",
    "url": "https://www.thestar.com.my/news/nation/2025/07/04/lhdn-identifies-845-cases-for-action-under-ops-tanjong-in-penang",
    "summary": "– The Inland Revenue Board has identified 845 cases for audit and enforcement action in the 10th Tax Compliance Operation, codenamed Ops Tanjong, conducted around Penang. The operation, codenamed Ops Tanjong, involving 238 officers, focused on key economic sectors, including manufacturing, electrical and electronics, digital and technology, logistics, contractors, and engineering. The operation, codenamed Ops Tanjong, involves 238 officers"
  },
  {
    "title": "Red Bull has \"been looking at what went wrong\" at the Red Bull Ring, claims Verstappen",
    "source": "F1technical.net",
    "publishedAt": "2025-07-04T03:00:00Z",
    "url": "https://www.f1technical.net/news/27239",
    "summary": "Max Verstappen says Red Bull has \"been looking at what went wrong\" at the Red Bull Ring on Saturday."
  },
  {
    "title": "Alexander-Arnold settling in as Real Madrid target Club World Cup glory",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-04T01:36:58Z",
    "url": "https://sports.yahoo.com/article/alexander-arnold-settling-real-madrid-013658249.html",
    "summary": "– Trent Alexander-Arnold is finding his footing at Real Madrid as they prepare to face Borussia Dortmund in the quarter-finals of the Club World Cup. The Liverpool defender is finding his footing as they prepare to face Borussia Dortmund in the quarter-finals. The 26-year-old created the only goal of the game for Gonzalo Garcia as Xabi Alonso's side beat Italian giants Juventus 1-0 in the last"
  },
  {
    "title": "74% off Clearance sale on Methven Aio Shower System only $499 (RRP $1992) +Free shipping",
    "source": "Ozbargain.com.au",
    "publishedAt": "2025-07-04T00:12:25Z",
    "url": "https://www.ozbargain.com.au/node/913610",
    "summary": "– AurajetTM spray technology delivers an immersive, invigorating shower experience with 20 hidden jets deflecting off precisely angled surfaces to deliver stunning fans of luxuriously dense droplets. 15 hidden jets deflect off precisely angled surfaces to deliver stunning fans of luxuriously dense droplets.r Water efficient Water flow rate is optimised to be water efficient without compromising the luxurious spray performance.r Limescale resistant to maintain shower performance Twin shower rail"
  },
  {
    "title": "Fund Bet on Samsung Breakthrough Shows Path for More Kospi Gains",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-04T01:38:38Z",
    "url": "https://finance.yahoo.com/news/asian-fund-pivots-samsung-bet-230000118.html",
    "summary": "– A peer-beating Asian equity fund is turning its sights on Samsung Electronics Co. amid a rally in Korean equities, reports Bloomberg. The $1.6 billion Ninety One Global Strategy Fund - Asian Equity Fund recently turned overweight on Samsung, according to London-based co-manager Charlie Linton. Many investors have \"mispriced\" the company because it's lagging rivals like SK Hynix in the high-"
  }
]