[
  {
    "title": "Chelsea beat Benfica to reach FIFA Club World Cup quarterfinal",
    "source": "Al Jazeera English",
    "publishedAt": "2025-06-29T01:06:07Z",
    "url": "https://www.aljazeera.com/sports/2025/6/29/chelsea-beat-benfica-to-reach-fifa-club-world-cup-quarterfinal",
    "summary": "– The first English side to reach the quarterfinals of the 2025 FIFA Club World Cup after a 4-1 win over Benfica in stoppage time in North Carolina on Saturday was a huge disappointment for the Blues. Reece James scored the opening goal of the game in the 64th minute of stoppage time. Pedro Neto and Kiernan Dewsbury-Hall equalised for Benfica in the fifth minute of stoppage time"
  },
  {
    "title": "The Italian Pavilion Expo 2025 Osaka / Mario Cucinella Architects + Yoshiki Matsuda Architects",
    "source": "ArchDaily",
    "publishedAt": "2025-06-29T02:00:00Z",
    "url": "https://www.archdaily.com/1031271/the-italian-pavilion-expo-2025-osaka-mario-cucinella-architects-plus-yoshiki-matsuda-architects",
    "summary": "– The Italian Pavilion for Expo 2025 in Osaka, Japan, will be the first of its kind in the world. Mario Cucinella, Architect and Founder of MCA, says the project is \"a unique opportunity to create a true stage, not only to showcase the culture, history, and innovation of our country but also to establish a space for future dialogue, for strengthening cultural, historical, and technological connections.\" Cucinella, a"
  },
  {
    "title": "Official Look at the FC Porto x New Balance 2002R",
    "source": "HYPEBEAST",
    "publishedAt": "2025-06-29T02:04:57Z",
    "url": "https://hypebeast.com/2025/6/fc-porto-new-balance-2002r-u2002rfp-release-info",
    "summary": "– New Balance is celebrating a decade-long partnership with Portuguese giants FC Porto with a special edition 2002R sneaker. The sneaker features a breathable navy mesh base, layered with panels of grey, white, and royal blue suede and leather, creating a sophisticated yet sporty appeal. The sneaker's sole unit retains the model's acclaimed ABZORB and N-ergy cushioning in the sole unit"
  },
  {
    "title": "After two-hour weather delay, Chelsea outlast Benfica in Club World Cup win",
    "source": "Fox Sports",
    "publishedAt": "2025-06-29T01:37:03Z",
    "url": "https://www.foxsports.com/stories/soccer/nkunkus-extratime-goal-sparks-chelsea-to-weatherdelayed-41-win-over-benfica-in-club-world-cup",
    "summary": "– Chelsea beat Benfica 4-1 in a FIFA Club World Cup Round of 16 match that was delayed for two hours due to lightning and took nearly five hours to complete. Christopher Nkunku scored off a rebound in extra time to give the English club a 1-0 lead in the first half, but the match was delayed for two hours because of lightning. Nkunku scored off a rebound in extra time in the 108th minute to give Chelsea "
  },
  {
    "title": "Chelsea outlast Benfica, weather delay to progress",
    "source": "ESPN",
    "publishedAt": "2025-06-29T01:05:02Z",
    "url": "https://www.espn.com/soccer/report/_/gameId/735945",
    "summary": "– Chelsea beat Benfica 4-1 in extra-time to reach the Club World Cup quarterfinals. The English side had been forced off the pitch for almost two hours due to a lightning storm near the Bank of America Stadium. Reece James opened the scoring in the 64th minute, but Benfica's Gianluca Prestianni was sent off two minutes into injury time. But ngel Di Mara scored from the penalty spot to"
  },
  {
    "title": "Steven Spielberg's Worst Movie, According To Letterboxd Users",
    "source": "/FILM",
    "publishedAt": "2025-06-29T00:00:00Z",
    "url": "https://www.slashfilm.com/1893968/steven-spielberg-worst-movie-letterboxd-users-something-evil/",
    "summary": "– Steven Spielberg's latest film, \"Something Evil,\" is a horror story that genuinely appeals to him as a director. It's a suffocating, ominous horror story that genuinely appeals to him because it's made for tele-movies, reports the New York Times. \"Something Evil\" is, however, extremely flawed, carrying all the markers of a television movie that was made"
  },
  {
    "title": "“My Parents Died Yesterday”: Woman Cuts Narcissistic Mom Off For Her Mental Health, Gets Threats",
    "source": "Boredpanda.com",
    "publishedAt": "2025-06-29T01:00:43Z",
    "url": "https://www.boredpanda.com/mom-threatening-cps-after-no-contact/",
    "summary": "– It's been a long time since a woman's relationship with her mother became so toxic that she decided to go no-contact with her mother, reports the New York Times. The woman's mother has decided that she has conflicting interests, and she's not afraid to ruin her relationship with her daughter to get what she wants, reports the New York Times. \"Even if they never did anything to hurt me again, I wouldn't have"
  },
  {
    "title": "Henry Golding Explains Why James Bond Role Is “Every Actor’s Kind Of Nightmare”",
    "source": "Deadline",
    "publishedAt": "2025-06-29T01:27:35Z",
    "url": "http://deadline.com/2025/06/henry-golding-james-bond-role-every-actors-nightmare-1236445301/",
    "summary": "– Henry Golding isn't exactly a fan of James Bond, but he thinks he'd love it more if there wasn't a \"overhanging cultural pressure\" to bring out more 007s. \"Why can't they bring out more agents or more 007's? I think that would be so much more fun, because there just isn't the restraints and the expectation,\" he"
  },
  {
    "title": "Kids Aren’t Allowed To Ride A Golden Retriever As A Horse, Dog Owner Shocked By Parents’ Reaction",
    "source": "Boredpanda.com",
    "publishedAt": "2025-06-29T01:00:58Z",
    "url": "https://www.boredpanda.com/entitled-parents-kids-ride-dog/",
    "summary": "– A netizen was surprised when some children tried to ride their dog on a public toy for their kids to ride on. The person who made the post via private message reached out to the person who made the post via private message and will update the article when they get back to us. We reached out to the person who made the post via private message and will update the article when they get back to us. We reached out to the person who made the post via private"
  },
  {
    "title": "Tomorrows World Today S09E04 1080p WEB h264-FREQUENCY",
    "source": "Rlsbb.cc",
    "publishedAt": "2025-06-29T01:43:32Z",
    "url": "https://post.rlsbb.cc/tomorrows-world-today-s09e04-1080p-web-h264-frequency/",
    "summary": "– If you're a fan of TV shows like Tomorrows World Today, you're in for a treat. Posted on June 29th, 2025 at 3:13 am in TV Shows by Lisa Season 9, Episode 04 – George sends Greg to the field to discover how nuclear energy is helping reach the goal of a zero-carbon footprint by 2050. Episode 04 – George sends Greg to the field to discover how nuclear energy is helping reach"
  },
  {
    "title": "Zohran Mamdani’s fiscal armageddon could bring NYC back to the bad old days",
    "source": "New York Post",
    "publishedAt": "2025-06-29T01:41:50Z",
    "url": "https://nypost.com/2025/06/28/business/zohran-mamdanis-fiscal-armageddon-could-bring-nyc-back-to-the-bad-old-days/",
    "summary": "– In the 1970s, New York City was dominated by machine politics, corruption and fiscal mismanagement, and the financial crisis came to an end. Rich Farley, a lawyer who works on financial transactions, wrote \"Drop Dead: How a Coterie of Corrupt Politicians, Bankers, Lawyers, Spin­meisters, and Mobsters Bankrupted New York, Got Bailed Out, Blamed the President and went back to Business as"
  },
  {
    "title": "1940s Women’s Shorts: A New Era of Style and Practicality",
    "source": "Vintag.es",
    "publishedAt": "2025-06-29T00:25:00Z",
    "url": "https://www.vintag.es/2025/06/1940s-womens-shorts.html",
    "summary": "– In the 1940s, women's shorts grew in acceptance thanks to their utility and the broader movement toward more relaxed women's clothing. While still considered informal, 1940s shorts emerged as a popular and functional garment, especially for leisure and athletic wear. While still considered informal, shorts grew in acceptance thanks to their utility and the broader movement toward more relaxed women's clothing. While still considered informal, shorts grew in acceptance thanks to"
  },
  {
    "title": "Articles On: Fairness, Middle East, US Dominance, TikTok, Cameras, Central Bank, Trade, and Chips",
    "source": "Hoover.org",
    "publishedAt": "2025-06-29T00:00:00Z",
    "url": "https://www.hoover.org/research/articles-fairness-middle-east-us-dominance-tiktok-cameras-central-bank-trade-and-chips",
    "summary": "– China's economic woes have eroded public perceptions of fairness, the Wall Street Journal reports. By Zhou Xin via South China Morning Post on June 24, 2025 America's Middle East Trap is China's strategic windfall by Adham Sahloul via War on the Rocks on June 18, 2025 Will China succeed in building a parallel order to US dominance? by Yukon Huang via Nikkei Asia on"
  },
  {
    "title": "“It Gets Juicy”: Company Tries To Deny Woman Maternity Leave, Underestimates Her",
    "source": "Boredpanda.com",
    "publishedAt": "2025-06-29T01:00:26Z",
    "url": "https://www.boredpanda.com/hr-tried-not-pay-maternity-leave-fake-reason/",
    "summary": "– A Reddit user recently shared how her employer tried to claim she wasn't eligible for maternity pay, hoping she would simply accept it and move on. Now that she has the proof to show they were lying, the company is scrambling to make it disappear. Read the full story below. According to the New York Times, up to 85% of women in the workforce will become mothers at some point in their careers. It's a testament to progress that"
  },
  {
    "title": "Chelsea overcomes Club World Cup weather delay, set up Palmeiras quarter-final",
    "source": "Japan Today",
    "publishedAt": "2025-06-29T01:45:22Z",
    "url": "https://japantoday.com/category/sports/chelsea-overcome-club-world-cup-weather-delay-set-up-palmeiras-quarter-final",
    "summary": "Chelsea beat Benfica 4-1 after extra time at the Club World Cup in North Carolina after a near two-hour delay."
  },
  {
    "title": "Chelsea boss lashes out at Club World Cup organisers after yet another weather delay",
    "source": "CNA",
    "publishedAt": "2025-06-29T02:25:08Z",
    "url": "https://www.channelnewsasia.com/sport/chelsea-boss-lashes-out-club-world-cup-organisers-after-yet-another-weather-delay-5209751",
    "summary": "– A two-hour delay at the Club World Cup delayed Chelsea's 4-1 win over Benfica in the quarter-finals of the men's World Cup, the BBC reports. \"I think it's a joke. It's not football,\" says Chelsea coach Enzo Maresca. \"If you suspend seven or eight games, that means probably this is not the right place to do this competition,\" he says. \"It's "
  },
  {
    "title": "xAI Grok 3.5 Renamed Grok 4 and Has Specialized Coding Model",
    "source": "Next Big Future",
    "publishedAt": "2025-06-29T01:06:18Z",
    "url": "https://www.nextbigfuture.com/2025/06/xai-grok-3-5-renamed-grok-4-and-has-specialized-coding-model.html",
    "summary": "– The xAI team is claiming good progress on their model. It will be called Grok 4 instead of Grok 3.5. Release just after July 4th. Needs one more big run for a specialized coding model. xAI has two AI data centers. The first data center had 100,000 Nvidia H100 for the Grok 3 training and it has 50,000 more H100 and 50,000 more H200 when Grok 3 was released."
  },
  {
    "title": " Chelsea oust Benfica, face Palmeiras in Club World Cup quarters",
    "source": "Onefootball.com",
    "publishedAt": "2025-06-29T00:46:00Z",
    "url": "https://onefootball.com/en/news/chelsea-oust-benfica-face-palmeiras-in-club-world-cup-quarters-41304913",
    "summary": "– Chelsea beat Benfica 4-1 in extra time in the 2025 Club World Cup in Charlotte, North Carolina, on Saturday, in the round of 16 of the 2025 Club World Cup. The English team dominated the first half, creating great chances, and goalkeeper Trubin made at least three good saves. Goalkeeper Otamendi headed the ball into the corner of the goal, but the goal was disallowed due to offside by the goalkeeper"
  },
  {
    "title": "Hamilton hails Ferrari after \"fantastic\" qualifying result for the Maranello-based team",
    "source": "F1technical.net",
    "publishedAt": "2025-06-29T01:00:00Z",
    "url": "https://www.f1technical.net/news/27195",
    "summary": "– Lewis Hamilton and Charles Leclerc sat out Friday's opening practice session at the Austrian Grand Prix, but they delivered a faultless performance in the final qualifying segment to finish fourth on the grid for tomorrow's Spielberg race. The Monegasque sat out the opening practice session as he handed over his SF-25 to Dino Beganovic, but he was on the pace in the final qualifying segment to secure P4"
  },
  {
    "title": "Delta Cancels 900+ Flights—Internal Document Reveals Airline Will Pay For Competitor Flights, Hotels, And Rental Cars",
    "source": "Viewfromthewing.com",
    "publishedAt": "2025-06-29T00:17:58Z",
    "url": "https://viewfromthewing.com/delta-cancels-900-flights-internal-document-reveals-airline-will-pay-for-competitor-flights-hotels-and-rental-cars/",
    "summary": "– Delta isn't blaming the weather for its operational meltdown, but it's agreeing to cover costs incurred by passengers during delays and passengers making their way on their own to their destinations. In fact, the carrier is agreeing to cover: Costs incurred by passengers during delays (e.g. hotels) Costs as passengers make their way on their own to their destinations (e.g., reimbursing rental cars"
  },
  {
    "title": "Vibrant Group Full Year 2025 Earnings: EPS: S$0.011 (vs S$0.001 in FY 2024)",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-29T00:14:47Z",
    "url": "https://finance.yahoo.com/news/vibrant-group-full-2025-earnings-001447569.html",
    "summary": "– Vibrant Group (SGX:BIP) is up 11% from a week ago, according to a new report from Simply Wall St. Vibrant Group shares are up 11% from a week ago, the Wall Street Journal reports. Vibrant Group shares are up 11% from a week ago, the Wall Street Journal reports. Vibrant Group shares are up 11% from a week ago, the Wall Street Journal reports. Vib"
  },
  {
    "title": "Starmer says he was 'heavily focused' on world affairs before U-turn on welfare",
    "source": "Sky.com",
    "publishedAt": "2025-06-29T02:02:00Z",
    "url": "https://news.sky.com/story/starmer-says-he-was-heavily-focused-on-world-affairs-before-u-turn-on-welfare-bill-13389954",
    "summary": "– Sir Keir Starmer has said he was \"heavily focused\" on world affairs before he was forced to U-turn on his welfare bill after rebellion by Labour MPs. In a Sunday Times piece, he said he was \"heavily focused\" on world affairs and the escalating tensions in the Middle East. \"My rule of leadership is, when things go well you get the plaudits; when things don"
  },
  {
    "title": "Cristiano Ronaldo reveals why he rejected FIFA Club World Cup 2025 clubs to stay at Al Nassr",
    "source": "Worldsoccertalk.com",
    "publishedAt": "2025-06-29T00:43:20Z",
    "url": "https://worldsoccertalk.com/news/cristiano-ronaldo-reveals-why-he-rejected-fifa-club-world-cup-2025-clubs-to-stay-at-al-nassr/",
    "summary": "– Cristiano Ronaldo turned down several offers to play in the FIFA Club World Cup 2025, despite his contract with Al Nassr initially set to expire at the end of June. The Portuguese forward also revealed that he opted to extend his deal with the Saudi Pro League club for two more years because he believes he will be a champion in Saudi Arabia. \"I had some offers to play in the Club World Cup, but I think it didn’"
  },
  {
    "title": "Javier Mascherano makes clear message to Lionel Messi, Inter Miami ahead of PSG game in FIFA Club World Cup",
    "source": "Worldsoccertalk.com",
    "publishedAt": "2025-06-29T03:09:58Z",
    "url": "https://worldsoccertalk.com/news/javier-mascherano-makes-clear-message-to-lionel-messi-inter-miami-ahead-of-psg-game-in-fifa-club-world-cup/",
    "summary": "– Paris Saint-Germain will be in the knockout round of the FIFA Club World Cup 2025, and it's going to be a tough test for Messi and his squad, reports the AP. \"It's clear that we're not nave — we know that going into tomorrow, we're considered the weakest team. But don't count us out ahead of time. We're going to fight — that"
  },
  {
    "title": "This Affordable Moisturizer May Be The Highest-Rated Product We've Ever Seen",
    "source": "Buzzfeed",
    "publishedAt": "2025-06-29T03:01:03Z",
    "url": "https://www.buzzfeed.com/tessaflores/this-affordable-moisturizer-may-be-the-highest-rated",
    "summary": "– The CeraVe facial moisturizer is one of the best-selling products on Amazon, and it's a top-notch product. It's a long-lasting 8-ounce tub that's been on sale for a few weeks now, reports the New York Times. \"I have tried various facial moisturizers, and have to say that I'm really happy with this one. I am 50, and have always had sensitive skin that "
  },
  {
    "title": "Wind Power’s Subsidy Sham: Grumet’s Plea Ignores 40 Years of Unreliability",
    "source": "Wattsupwiththat.com",
    "publishedAt": "2025-06-29T01:00:00Z",
    "url": "https://wattsupwiththat.com/2025/06/28/10323801/",
    "summary": "– The American Clean Power Association has a long list of \"crony capitalists\" who seek wealth from the political means (special government favor) rather than consumer demand in the market with taxpayers neutral. In a letter to Senator John Thune and Rep. Mike Crapo, Jason Grumet of the American Clean Power Association urged them to \"be thoughtful when phasing out clean energy tax credits.\" \"It is ironic that Jason Grumet of the"
  },
  {
    "title": "Elon Musk doubles down on criticism of ‘Big Beautiful Bill’ calling it ‘utterly insane’ and ‘political suicide’",
    "source": "New York Post",
    "publishedAt": "2025-06-29T02:37:11Z",
    "url": "https://nypost.com/2025/06/28/us-news/elon-musk-doubles-down-on-criticism-of-big-beautiful-bill-calling-it-utterly-insane-and-political-suicide/",
    "summary": "– Elon Musk, the SpaceX CEO who turned 54 on Saturday, slammed the Trump-backed \"Big Beautiful Bill\" on social media Saturday, calling it \"utterly insane\" and \"political suicide.\" The former DOGE chief wrote that the bill would \"destroy millions of jobs in America and cause immense strategic harm to our country,\" reports the Wall Street Journal. \"Polls show that this bill is political suicide for the Republican Party,\""
  },
  {
    "title": "Nkunku fires Chelsea into Club World Cup quarters as Benfica downed",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-29T00:54:40Z",
    "url": "https://sports.yahoo.com/article/nkunku-fires-chelsea-club-world-005440731.html",
    "summary": "Chelsea defeated Benfica 4-1 in extra time in a weather-disrupted last-16 clash at the Bank of America Stadium in North Carolina."
  }
]