[
  {
    "title": "Trump calls for US central bank head to quit immediately",
    "source": "BBC News",
    "publishedAt": "2025-07-03T01:09:56Z",
    "url": "https://www.bbc.com/news/articles/crmv4ldv923o",
    "summary": "– President Trump has called for the chair of the US Federal Reserve to quit immediately, in an escalation of his attacks on Jerome Powell. \"'Too Late' should resign immediately!!!\", Trump wrote on his Truth Social platform. \"It's not permitted under law for the White House to force him out,\" he wrote. \"It's not permitted under law\" for the White House to force him out. \"It's"
  },
  {
    "title": "Tesla’s Numbers Are In, and They’re Not Good",
    "source": "Gizmodo.com",
    "publishedAt": "2025-07-03T01:10:56Z",
    "url": "https://gizmodo.com/teslas-numbers-are-in-and-theyre-not-good-2000623670",
    "summary": "– Elon Musk's political turn has weighed heavily on consumer demand, reports Bloomberg. In the second quarter of 2025, Tesla delivered 443,956 vehicles, a 13.5 percent decline from the same period in 2024. Nearly all of those deliveries were for the company's two most popular models: the Model 3 and Model Y. The drop underscores the lasting impact of Elon Musk's political turn, which has alienated parts of its original"
  },
  {
    "title": "Tech Talk: NFC is getting an upgrade. But how does NFC work?",
    "source": "Android Central",
    "publishedAt": "2025-07-03T00:14:06Z",
    "url": "https://www.androidcentral.com/phones/tech-talk-nfc-is-getting-an-upgrade-but-how-does-nfc-work",
    "summary": "– The NFC Forum has announced NFC Release 15, which extends the range of Near Field Communications from 0.5 centimeters to a full 2 centimeters, extending the range by a factor of four. Notably, the range of NFC has been increased from 0.5 centimeters to a full 2 centimeters, extending the range by a factor of four. Along with changes to increase reliability, speed, and sustainability"
  },
  {
    "title": "Scientists just simulated the “impossible” — fault-tolerant quantum code cracked at last",
    "source": "Science Daily",
    "publishedAt": "2025-07-03T01:41:57Z",
    "url": "https://www.sciencedaily.com/releases/2025/07/250702214157.htm",
    "summary": "– Researchers from Chalmers University of Technology in Sweden, the University of Milan, the University of Granada, and the University of Tokyo have unveiled a method for simulating specific types of error-corrected quantum computations. To develop truly reliable quantum computers, researchers must be able to correct the errors arising in quantum computations, a vital yet extraordinarily difficult task. To develop truly reliable quantum computers, researchers must be able to simulate"
  },
  {
    "title": "Microsoft Just Fired About 9,000 People While Making Billions",
    "source": "Gizmodo.com",
    "publishedAt": "2025-07-03T00:54:49Z",
    "url": "https://gizmodo.com/microsoft-just-fired-about-9000-people-while-making-billions-2000623667",
    "summary": "– Microsoft is laying off thousands of employees, even as its profits and stock price hit historic highs. The software giant, which is playing a central role in the generative AI boom, confirmed to Gizmodo on Wednesday that it's undergoing another major round of layoffs. It's estimated the total cuts for July to be around 8,777 jobs, or just under 4 percent of the global workforce. The company last disclosed its global workforce at 228,000"
  },
  {
    "title": "The best retrofit smart door lock is now available in the U.S.",
    "source": "Android Central",
    "publishedAt": "2025-07-03T02:31:47Z",
    "url": "https://www.androidcentral.com/accessories/smart-home/nuki-best-retrofit-smart-door-lock-is-now-available-in-the-u-s",
    "summary": "– Nuki is making its debut in the U.S. with the Smart Lock. The local is designed to be installed over existing single-cylinder deadbolts, and it has Matter integration alongside Apple Home, Google Home, Alexa, SmartThings, and Home Assistant. Interestingly, the Smart Lock costs just $159 on Amazon U.S.; this is a different model to the Smart Lock Pro that sells for €269 ($317) in"
  },
  {
    "title": "Google Home makes it even easier to share your smart home devices with others",
    "source": "Android Central",
    "publishedAt": "2025-07-03T02:57:35Z",
    "url": "https://www.androidcentral.com/accessories/smart-home/google-home-makes-it-even-easier-to-share-your-smart-home-devices-with-others",
    "summary": "– Google Home has rolled out its Member access feature, and it's now available to everyone. With version 3.33, users can designate household members as either \"Admins\" with full control or \"Members\" with limited access. The Member role lets you invite just about anyone—kids, roommates, even roommates—so you can manage access to your smart home devices without the chaos. As usual, Admins in Google Home get full"
  },
  {
    "title": "Is the world's largest CCTV surveillance camera vendor going to be the next Huawei? Canada bans Hikvision amidst security fears",
    "source": "TechRadar",
    "publishedAt": "2025-07-03T00:03:00Z",
    "url": "https://www.techradar.com/pro/is-the-worlds-largest-cctv-surveillance-camera-vendor-going-to-be-the-next-huawei-canada-gov-bans-hikvision-amidst-security-fears",
    "summary": "– Hikvision Canada Inc., one of the world's largest producers of surveillance cameras, has been ordered to cease operations in the country, citing national security concerns. \"The government has determined that Hikvision Canada Inc.’s continued operations in the country would be injurious to Canada’s national security,\" said Industry Minister Mélanie Joly. \"The government has determined that Hikvision Canada Inc.’s continued operations in the country would be"
  },
  {
    "title": "Deafness reversed: Single injection brings hearing back within weeks",
    "source": "Science Daily",
    "publishedAt": "2025-07-03T01:41:48Z",
    "url": "https://www.sciencedaily.com/releases/2025/07/250702214148.htm",
    "summary": "– Gene therapy can improve hearing in children and adults with congenital deafness or severe hearing impairment, according to a new study. Researchers at Karolinska Institutet used a synthetic adeno-associated virus (AAV) to deliver a functional version of the OTOF gene to the inner ear via a single injection through a membrane at the base of the cochlea called the round window. The effect of the gene therapy"
  },
  {
    "title": "How Dillard’s Is Transforming The Shopping Experience With Mobile Tech",
    "source": "redmondpie.com",
    "publishedAt": "2025-07-03T00:37:00Z",
    "url": "https://www.redmondpie.com/how-dillards-is-transforming-the-shopping-experience-with-mobile-tech/",
    "summary": "– Dillard's is not just keeping up—we are pushing forward. We use mobile technology to improve how customers find, buy, and enjoy our products. In this article, we show exactly how our approach to mobile tech upgrades every part of the Dillard's experience. Dillard's Mobile App Our app is central to our mobile plans. It gives you direct access to store info, new arrivals, and exclusive deals. People expect quick access, real-time updates"
  },
  {
    "title": "Taoiseach to attend Expo 25 following talks with Japan PM",
    "source": "RTE",
    "publishedAt": "2025-07-03T03:33:37Z",
    "url": "https://www.rte.ie/news/ireland/2025/0703/1521587-taoiseach-japan/",
    "summary": "– Ireland's participation in Expo 25 has cost more than €16 million over the past three years, with the pavilion itself accounting for nearly €7 million of that total. It comes as the Taoiseach and Japanese Prime Minister held talks in Tokyo to discuss deepening trade links, bilateral relations and cybersecurity. Ireland's multi-million euro pavilion is focused on the theme that \"Creativity Connects People\". It is being held on Yumeshima"
  },
  {
    "title": "Taoiseach to attend Expo 25 following talks with Japan PM",
    "source": "RTE",
    "publishedAt": "2025-07-03T03:33:37Z",
    "url": "https://www.rte.ie/news/ireland/2025/0703/1521587-taoiseach-expo-25/",
    "summary": "– Ireland's participation in Expo 25 has cost more than €16 million over the past three years, with the pavilion itself accounting for nearly €7 million of that total. It comes as the Taoiseach and Japanese Prime Minister held talks in Tokyo to discuss deepening trade links, bilateral relations and cybersecurity. Ireland's multi-million euro pavilion is focused on the theme that \"Creativity Connects People\". It is being held on Yumeshima"
  },
  {
    "title": "‘Nine Perfect Strangers’ Season 2 Ending Explained: It’s All About Connections",
    "source": "Deadline",
    "publishedAt": "2025-07-03T01:02:10Z",
    "url": "http://deadline.com/2025/07/nine-perfect-strangers-season-2-ending-explained-1236448620/",
    "summary": "– Nine Perfect Strangers' first season, based on Liane Moriarty's novel and nine characters within it, has come to an end on Hulu. The show's first season arrived in 2021, based on the novel and nine characters within it that visited Nicole Kidman's Masha Dmitrichenko at Tranquillum House in fictional Cabrillo, CA, and featured nine new guests, including David Sharp"
  },
  {
    "title": "Tesla competitor BYD axes Mexico factory plans",
    "source": "Business Insider",
    "publishedAt": "2025-07-03T02:54:19Z",
    "url": "https://www.businessinsider.com/byd-halts-mexico-factory-plans-trump-tariffs-brazil-americas-li-2025-7",
    "summary": "– The world's largest electric vehicle maker is halting plans to build a major factory in Mexico due to concerns about US trade policies. On Wednesday, BYD said that the company still plans to expand further into North or South America, but it does not have a timeline for the plan. \"Now everybody is rethinking their strategy in other countries. We want to wait for more clarity before making our decision,\" Stella Li, an executive vice president,"
  },
  {
    "title": "A Q-Tip and spotless car were key evidence linking Bryan Kohberger to murders of 4 Idaho students",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-07-03T00:33:29Z",
    "url": "https://www.yahoo.com/news/q-tip-spotless-car-were-003329007.html",
    "summary": "– The lead prosecutor tasked with finding justice for four University of Idaho students killed in a grisly quadruple stabbing more than two years ago laid out his key evidence Wednesday at a court hearing for Bryan Kohberger, who agreed to plead guilty earlier this week to avoid the death penalty. The evidentiary summary included a DNA-laden Q-tip plucked from the garbage in the dead of the night, a getaway car stripped so"
  },
  {
    "title": "Who were the Galatians? How did they get where they were?",
    "source": "Upenn.edu",
    "publishedAt": "2025-07-03T01:49:47Z",
    "url": "https://languagelog.ldc.upenn.edu/nll/?p=69732",
    "summary": "– When I was a wee lad, I had a hard time comprehending just who were all of those epistles in the New Testament addressed to, but the ones that attracted me most were the 9 Pauline letters to Christian churches that we refer to as \"epistles.\" I was most captivated by the letter to the Galatians, who were located in a region of Anatolia known as Galatia,"
  },
  {
    "title": "2025’s Midway Point: A California Assessment",
    "source": "Hoover.org",
    "publishedAt": "2025-07-03T00:00:00Z",
    "url": "https://www.hoover.org/research/2025s-midway-point-california-assessment",
    "summary": "– California's political calendar dictates that 2025 should be a slow year—slow in that it's a void between two statewide elections, when (in theory) the two major parties are licking their wounds over the results of the near past and planning for the next engagement. But that hasn't been the case in the Golden State. What have we learned so far about 2025? 1. Gubernatorial Evolution/"
  },
  {
    "title": "Rob McElhenney Addresses Name Change: “Call Me Whatever You Want”",
    "source": "Deadline",
    "publishedAt": "2025-07-03T02:00:20Z",
    "url": "http://deadline.com/2025/07/rob-mcelhenney-addresses-name-change-1236448650/",
    "summary": "– It's always Sunny in Philadelphia star Rob McElhenney's first name change since filing to change his name to Rob Mac last week. \"I'm shortening my name to Rob Mac—mostly a stage name, but I digress,\" he wrote on Twitter Tuesday. \"It was a crazy time. But times have changed, and most people already call me Rob Mac anyway,\" he said. \"It was a crazy"
  },
  {
    "title": "“A national disgrace”: Republicans blast Pentagon’s “unacceptable” Ukrainian weapons freeze",
    "source": "Salon",
    "publishedAt": "2025-07-03T02:26:58Z",
    "url": "https://www.salon.com/2025/07/02/a-national-disgrace-republicans-blast-pentagons-unacceptable-ukrainian-weapons-freeze/",
    "summary": "– The Pentagon has halted scheduled shipments of missiles and munitions to Ukraine, prompting a chorus of protests from Republicans in the House over the move. The move comes amid a tripling of drone strikes on the country in the last six months and just after Russia launched the largest aerial attack on Ukraine to date. \"Now is the time to show Putin we mean business,\" Rep. Brian Fitzpatrick tells X. \"This is "
  },
  {
    "title": "Checking in on the “going all-in on alienating your core consumers” strategy",
    "source": "Lawyersgunsmoneyblog.com",
    "publishedAt": "2025-07-03T01:23:28Z",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/07/checking-in-on-the-going-all-in-on-alienating-your-core-consumers-strategy",
    "summary": "– Tesla delivered just 384,000 vehicles between April and June, a massive drop from 444,000 vehicles over the same period last year, the New York Times reports. That's a massive drop from the 444,000 deliveries over the same period last year, the Wall Street Journal reports. \"We expect Tesla’s 2Q25 deliveries to miss... but this shouldn’t come as a surprise,\" Deutsche Bank analysts wrote in a note earlier this week, citing cra"
  },
  {
    "title": "TN Govt. Saves School Children From Smut Like Magic Tree House, Calvin & Hobbes, & A Light In The Attic",
    "source": "Techdirt",
    "publishedAt": "2025-07-03T02:43:00Z",
    "url": "https://www.techdirt.com/2025/07/02/tn-govt-saves-school-children-from-smut-like-magic-tree-house-calvin-hobbes-a-light-in-the-attic/",
    "summary": "– Tennessee's school librarians have purged hundreds of books from some of the state's public libraries, reports the New York Times. The list includes children's author Mary Pope Osborne, children's poet Shel Silverstein, and Calvin and Hobbes cartoonist Bill Watterson, reports the New York Times. The state legislature amended the \"Age-Appropriate Materials Act of 2022\" to specify that any materials that \"in"
  },
  {
    "title": "Mike Johnson Stares Down Hardliners",
    "source": "Politicalwire.com",
    "publishedAt": "2025-07-03T01:32:33Z",
    "url": "https://politicalwire.com/2025/07/02/mike-johnson-stares-down-hardliners/",
    "summary": "– Politico reports that House Republican hard-liners vowed to deprive Speaker Mike Johnson of the needed votes should he try to force party's domestic policy megabill through the House overnight, just before Johnson ordered votes to move forward. \"The ultimatum came after House Freedom Caucus huddled among themselves following hours of negotiating with GOP leaders, who had said they were making progress with the holdouts and planned to grind forward with "
  },
  {
    "title": "Fractured House GOP Fights Over Trump’s Bill",
    "source": "Politicalwire.com",
    "publishedAt": "2025-07-03T00:29:04Z",
    "url": "https://politicalwire.com/2025/07/02/fractured-house-gop-fights-over-trumps-bill/",
    "summary": "– President Trump's marquee domestic policy bill was stalled in the House on Wednesday, with the chamber frozen in place as Speaker Mike Johnson labored to overcome resistance in his own ranks and push the measure to a final vote, the New York Times reports. \"After a day of private cajoling by Mr. Trump at the Capitol and Mr. Trump at the White House, party leaders expressed optimism that they might soon be able to move ahead,\" the"
  },
  {
    "title": "Jurassic World: Rebirth was filmed in Thailand. Here are the featured locations you can visit",
    "source": "CNA",
    "publishedAt": "2025-07-03T01:39:10Z",
    "url": "https://cnalifestyle.channelnewsasia.com/travel/jurassic-world-rebirth-thailand-locations-467326",
    "summary": "During the making of the film, over 500 Thai crew members were involved in the creation of the film."
  },
  {
    "title": "Microsoft to cut up to 9,000 jobs as it invests in AI",
    "source": "BBC News",
    "publishedAt": "2025-07-03T03:09:43Z",
    "url": "https://www.bbc.com/news/articles/cdxl0w1w394o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "summary": "– Microsoft has confirmed that it will lay off as many as 9,000 more jobs, in its latest wave of job cuts this year, reports the BBC. The tech giant said several divisions would be affected, including its Xbox video gaming unit, and its studio director of ZeniMax Online Studios, Matt Firor. \"While I won't be working on the game anymore, I will be cheering you on and adding to the thousands of hours I've already spent in"
  },
  {
    "title": "How USMNT Gold Cup hero Diego Luna quickly became a Mauricio Pochettino favorite after flirting with Mexico",
    "source": "CBS Sports",
    "publishedAt": "2025-07-03T02:10:32Z",
    "url": "https://www.cbssports.com/soccer/news/how-usmnt-gold-cup-hero-diego-luna-quickly-became-a-mauricio-pochettino-favorite-after-flirting-with-mexico/",
    "summary": "Mauricio Pochettino says Diego Luna's nose broke in the first half of the U.S. men's national team's 3-0 win over Costa Rica in January. \"I was very surprised, because it was broken, you know?\" Pochettino said in a post-match interview. \"But I didn't want to say nothing [with] too much drama, because [it might] scare him. I said,"
  },
  {
    "title": "Teen social media ban: Answering every question about Australia’s ‘world-first’ plan",
    "source": "Crikey",
    "publishedAt": "2025-07-03T01:19:04Z",
    "url": "http://www.crikey.com.au/2025/07/03/teen-social-media-ban-questions-faqs/",
    "summary": "– Australia's decision to introduce a teen social media ban has been called a \"world-first\" by Crikey. The Australian federal parliament passed the Online Safety Amendment (Social Media Minimum Age) Bill in November 2024, which forces social media companies to enforce a minimum age of 16 for having an account on their platforms. By the end of the year, Australia will have a legal minimum age of 16 for platforms like TikTok, Facebook and"
  },
  {
    "title": "Your Roku has secret menus and screens - here's how to unlock them",
    "source": "ZDNet",
    "publishedAt": "2025-07-03T02:00:17Z",
    "url": "https://www.zdnet.com/home-and-office/home-entertainment/your-roku-has-secret-menus-and-screens-heres-how-to-unlock-them/",
    "summary": "– ZDNET's recommendations are based on hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we're assessing. When you click through from our site to a retailer and buy a product or service, we may earn affiliate"
  },
  {
    "title": "Modern Victorian House Guide: Style, Renovation & Tips",
    "source": "Ahouseinthehills.com",
    "publishedAt": "2025-07-03T02:47:37Z",
    "url": "https://ahouseinthehills.com/modern-victorian-house-guide-style-renovation-tips/",
    "summary": "– A modern Victorian house blends the ornate, romantic beauty of 19th-century architecture with the clean lines, efficiency, and functionality of contemporary design. It celebrates historic craftsmanship, such as turrets, trims, and high ceilings, while embracing modern comforts, including open layouts, smart technology, and sustainable materials. Here's a quick comparison to help you identify and apply each style effectively based on your design goals and your"
  },
  {
    "title": "Luna leads U.S. past Guatemala to Gold Cup final",
    "source": "ESPN",
    "publishedAt": "2025-07-03T01:20:11Z",
    "url": "https://www.espn.com/soccer/report/_/gameId/735346",
    "summary": "– The U.S. hung on to beat Guatemala 2-1 to reach the Concacaf Gold Cup final for the 13th time since 2021. Diego Luna scored twice in the first 15 minutes of the match, then scored with his right in the 15th for his third goal in two games. Olger Escobar, 18, cut inside and slid a shot from inside the area between Matt Freese and the far post in the second minute of stop"
  }
]