[
  {
    "title": "OpenAI and Microsoft are dueling over AGI. These real-world tests will prove when AI is really better than humans.",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T09:00:01Z",
    "url": "https://www.businessinsider.com/openai-microsoft-duel-agi-real-world-tests-ai-better-humans-2025-6",
    "summary": "– Until OpenAI achieves Artificial General Intelligence (AGI), Microsoft gets a lot of valuable technological and financial benefits from the startup. That's the situation right now: Until OpenAI achieves Artificial General Intelligence, where AI capabilities surpass those of humans, Microsoft gets a lot of valuable technological and financial benefits from the startup. That's the situation right now: Until OpenAI achieves Artificial General Intelligence (AGI), where"
  },
  {
    "title": "Amazon Slashes Dyson V15 Laser Price Twice in 3 Days, Don’t Wait for Prime Day",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T11:10:47Z",
    "url": "https://gizmodo.com/amazon-slashes-dyson-v15-laser-price-twice-in-3-days-dont-wait-for-prime-day-2000621819",
    "summary": "– Amazon has dropped the price of the Dyson V15 cordless vacuum for the second time in a few days, bringing it down to $599. That's a significant cut from its previous list price of $649 and a huge drop from its original $799 list price. The Dyson V15 Detect Plus comes with a powerful motor that delivers up to 100% more power than previous generations, which makes it suitable for deep cleaning your entire home. The"
  },
  {
    "title": "Paul dominates Chavez and calls out big names",
    "source": "BBC News",
    "publishedAt": "2025-06-29T06:31:50Z",
    "url": "https://www.bbc.com/sport/boxing/articles/cvgn9vvnl8zo",
    "summary": "Paul said he was \"embarrassed\" by the boos he received from the crowd at the UFC World Championships in Anaheim."
  },
  {
    "title": "1500W Portable Power Station Is Cheaper Than on Black Friday, And You’ll Get a Free 200W Solar Panel Too",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T11:40:03Z",
    "url": "https://gizmodo.com/1500w-portable-power-station-is-cheaper-than-on-black-friday-and-youll-get-a-free-200w-solar-panel-too-2000621824",
    "summary": "– Amazon is kicking off Prime Day deals earlier this year with a bundle that includes the Jackery Explorer 1000 V2 power station and a 200W solar panel for just $698. That's a staggering 46% off the normal bundle price of $1,299. That's a staggering 46% off the normal bundle price of $1,299. That's a staggering 46% off the normal bundle price of $1,299. That'"
  },
  {
    "title": "I spent a week living like it was 1993 — here’s how it went",
    "source": "Android Authority",
    "publishedAt": "2025-06-29T11:00:07Z",
    "url": "https://www.androidauthority.com/living-like-its-1993-3569203/",
    "summary": "– It's been a long time since I've been able to live without modern technology, but this week, I'm trying to figure out what it's like to live without technology. I'm trying to figure out what it's like to live without modern technology, and I've been able to do just that for a week now. I'm trying to figure out what it's like to live without modern technology, and I"
  },
  {
    "title": "Open-Source Knob Packed with Precision",
    "source": "Hackaday",
    "publishedAt": "2025-06-29T05:00:50Z",
    "url": "https://hackaday.com/2025/06/28/open-source-knob-packed-with-precision/",
    "summary": "– The Ploopy Knob is a small, compact, and thoughtfully designed control device that uses a magnetic encoder that senses movement with remarkable precision. It's made of 3D-printed case and a USB-C connection, and it's fully open-source. It's available for pre-order on GitHub, and it's available for pre-order at Amazon.com/PloopyKnob. The"
  },
  {
    "title": "MP refers himself to commissioner over 'cash for questions' claims",
    "source": "BBC News",
    "publishedAt": "2025-06-29T11:05:05Z",
    "url": "https://www.bbc.com/news/articles/c4gdrjqvp0jo",
    "summary": "– A Conservative MP has referred himself to a standards commissioner after it was claimed a company he worked for helped him write questions to the government about space data and emissions tracking. George Freeman, 57, has been an MP since 2010 and served as science minister under both Boris Johnson and Rishi Sunak, reports the Sunday Times. In another email, he allegedly asked the company's director \"what to ask about\" when submitting questions about the"
  },
  {
    "title": "Top 5 Essential Toolbox Innovations for Modern DIY and Home Improvement in 2025",
    "source": "Yanko Design",
    "publishedAt": "2025-06-29T11:40:44Z",
    "url": "https://www.yankodesign.com/2025/06/29/top-5-essential-toolbox-innovations-for-modern-diy-and-home-improvement-in-2025/",
    "summary": "– The humble toolbox has become an indispensable companion in nearly every home. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge. Although small in size, it offers the reassurance of being prepared for anything from assembling furniture to tightening a hinge"
  },
  {
    "title": "Iran could start enriching uranium for bomb within months, UN nuclear chief says",
    "source": "BBC News",
    "publishedAt": "2025-06-29T06:34:42Z",
    "url": "https://www.bbc.com/news/articles/c79qeqg89g2o",
    "summary": "US strikes on Iran's nuclear sites have caused \"severe but not total\" damage, UN nuclear chief Rafael Grossi has said."
  },
  {
    "title": "The new must-have for CEOs: An AI whisperer",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T08:58:01Z",
    "url": "https://www.businessinsider.com/ceo-ai-whisperer-adviser-2025-6",
    "summary": "– A year ago, Glenn Hopper was advising just a handful of company leaders on how to embed AI agents and tools like ChatGPT throughout their organizations. Today, the Memphis-based AI strategist has an extensive waitlist of C-suite executives seeking his help with those tasks and more, Business Insider reports. \"Everything is inbound,\" said Conor Grennan, chief of AI Mindset, an AI consulting and training firm he founded"
  },
  {
    "title": "Digimon deserves to escape Pokémon’s shadow",
    "source": "Polygon",
    "publishedAt": "2025-06-29T11:26:57Z",
    "url": "https://www.polygon.com/609770/digimon-story-time-stranger-vs-pokemon",
    "summary": "– If you think Digimon are a cheap Pokémon ripoff inspired by a virtual pet toy from the ’90s, you don't know Digimon. Digimon Story: Time Stranger is a new RPG out of Summer Game Fest. Based on early gameplay and reveals, Bandai has at least aimed to produce a game for a wider audience that addresses past mistakes. From investing in making the world of Time Stranger feel"
  },
  {
    "title": "A billion choices",
    "source": "Seths.blog",
    "publishedAt": "2025-06-29T09:30:00Z",
    "url": "https://seths.blog/2025/06/a-billion-choices/",
    "summary": "– If you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a gamer or a nerd, and you're a game"
  },
  {
    "title": "Maresca questions US hosting Club World Cup",
    "source": "BBC News",
    "publishedAt": "2025-06-29T05:51:27Z",
    "url": "https://www.bbc.com/sport/football/articles/cx2nq51wd1yo",
    "summary": "Hundreds of teams have been affected by severe weather during the Club World Cup in Charlotte, North Carolina."
  },
  {
    "title": "The CEO building the 'Ikea of factories' wants to democratize semiconductor production",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T09:00:01Z",
    "url": "https://www.businessinsider.com/nanotronics-ceo-interview-semiconductor-fab-factories-local-2025-6",
    "summary": "– Matthew Putman is the CEO of Brooklyn-based Nanotronics, which he cofounded with his father in 2010. Putman, 50, is the CEO of the Brooklyn-based company, which started out building microscopes and tools to detect defects in semiconductors, among other materials. Now, the company builds small, modular semiconductor manufacturing plants called Cubefabs, which measure anywhere from 25,000 square feet for the smallest units up to 10,000 square feet for the largest"
  },
  {
    "title": "When will F1 movie be on Apple TV? Here’s the streaming release date",
    "source": "9to5Mac",
    "publishedAt": "2025-06-29T10:50:31Z",
    "url": "https://9to5mac.com/2025/06/29/f1-movie-when-stream-apple-tv/",
    "summary": "– F1: The Movie is making a big splash in its opening weekend at the box office at movie theaters around the world. But as an Apple production, it will end up streaming on Apple TV+. The movie premiered in theaters in the United States on June 27. After about 45 days, the film will hit its PVOD window; premium video on demand. This means it will be available to buy or rent on digital stores, including Apple TV Store but also"
  },
  {
    "title": "European U21 champions again - but who could make World Cup?",
    "source": "BBC News",
    "publishedAt": "2025-06-29T10:16:49Z",
    "url": "https://www.bbc.com/sport/football/articles/c62gz7w5jpgo",
    "summary": "Those named in Tuchel's squad for the Euro 2023 finals in Slovakia and Senegal are among those who could make the step up from the class of 25 next summer."
  },
  {
    "title": "Chelsea beat Benfica to reach FIFA Club World Cup quarterfinal",
    "source": "Al Jazeera English",
    "publishedAt": "2025-06-29T01:06:07Z",
    "url": "https://www.aljazeera.com/sports/2025/6/29/chelsea-beat-benfica-to-reach-fifa-club-world-cup-quarterfinal",
    "summary": "– The first English side to reach the quarterfinals of the 2025 FIFA Club World Cup after a 4-1 win over Benfica in stoppage time in North Carolina on Saturday was a huge disappointment for the Blues. Reece James scored the opening goal of the game in the 64th minute of stoppage time. Pedro Neto and Kiernan Dewsbury-Hall equalised for Benfica in the fifth minute of stoppage time"
  },
  {
    "title": "Kremlin says Europe will feel the recoil from its 'illegal' sanctions on Russia",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-29T09:50:13Z",
    "url": "https://ca.news.yahoo.com/kremlin-says-europe-feel-recoil-095013464.html",
    "summary": "– Russia's invasion of Ukraine in 2022 triggered a wave of Western sanctions on Russia, and the West said that it hoped its sanctions would force President Vladimir Putin to seek peace in Ukraine, reports Reuters. The Kremlin said in remarks published on Sunday that the tougher the sanctions imposed on Russia by Europe, the more painful the recoil would be for Europe's own economies as Russia had grown resistant to such \"illegal\" sanctions."
  },
  {
    "title": "'Tuipulotu finds feet again and hails world-class Ringrose and Russell'",
    "source": "BBC News",
    "publishedAt": "2025-06-29T09:02:17Z",
    "url": "https://www.bbc.com/sport/rugby-union/articles/cly8g1e5578o",
    "summary": "Sione Tuipulotu feels he's getting his feet back under him after his Test debut against Scotland in Perth."
  },
  {
    "title": "Concert tickets are wildly expensive. What would it take to actually make them affordable?",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T08:38:01Z",
    "url": "https://www.businessinsider.com/ticket-prices-expensive-cheap-beyonce-taylor-swift-ticketmaster-stubhub-seatgeek-2025-6",
    "summary": "– Ticketmaster, the ticketing giant that merged with Live Nation in 2010, is facing a lawsuit from the Department of Justice, which says it's a monopoly that should be broken up. Live Nation says the lawsuit is a \"performative attempt to grab headlines by asking for a breakup that won't ever happen,\" and it's a \"performative attempt to grab headlines by asking for a breakup that"
  },
  {
    "title": "If You Own an iPhone, Amazon Is Offering a Free AirTag Just Before Prime Day",
    "source": "Gizmodo.com",
    "publishedAt": "2025-06-29T08:28:41Z",
    "url": "https://gizmodo.com/if-you-own-an-iphone-amazon-is-offering-a-free-airtag-prime-day-2000619896",
    "summary": "– AirTags have never been on sale from the Apple website or in Apple stores. Amazon is also running a great deal just in time for Prime Day: purchase three AirTags and receive a fourth free. That drops the price of four AirTags to just $74, down from the regular $99 ($25 each + get one free). That's one of the best deals we've ever seen on these trackers. For the best value, a pack"
  },
  {
    "title": "The Italian Pavilion Expo 2025 Osaka / Mario Cucinella Architects + Yoshiki Matsuda Architects",
    "source": "ArchDaily",
    "publishedAt": "2025-06-29T02:00:00Z",
    "url": "https://www.archdaily.com/1031271/the-italian-pavilion-expo-2025-osaka-mario-cucinella-architects-plus-yoshiki-matsuda-architects",
    "summary": "– The Italian Pavilion for Expo 2025 in Osaka, Japan, will be the first of its kind in the world. Mario Cucinella, Architect and Founder of MCA, says the project is \"a unique opportunity to create a true stage, not only to showcase the culture, history, and innovation of our country but also to establish a space for future dialogue, for strengthening cultural, historical, and technological connections.\" Cucinella, a"
  },
  {
    "title": "A millennial explains how he made $500K secretly working 3 remote jobs in tech",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T07:33:01Z",
    "url": "https://www.businessinsider.com/how-millennial-earned-500k-annually-working-three-remote-tech-jobs-2025-6",
    "summary": "– When he got laid off from one of his jobs last August, he thought that secretly working multiple jobs would protect him from layoffs. But he was wrong. Between 2021 and 2023, Charles earned as much as $300,000 annually by juggling multiple jobs in product and tech. The extra income helped him pay down debt, renovate his home, buy a rental property, and purchase a new car. \"All that extra money I"
  },
  {
    "title": "Humphries beats Aspinall in US Darts Masters final",
    "source": "BBC News",
    "publishedAt": "2025-06-29T06:07:36Z",
    "url": "https://www.bbc.com/sport/darts/articles/cp825zlw2y1o",
    "summary": "World number one Luke Humphries beat Nathan Aspinall 8-6 to reach the final of the US Darts Masters at Madison Square Garden."
  },
  {
    "title": "Jake Paul Claims Unanimous Decision Victory Over Julio Cesar Chavez Jr.",
    "source": "HYPEBEAST",
    "publishedAt": "2025-06-29T09:41:43Z",
    "url": "https://hypebeast.com/2025/6/jake-paul-julio-cesar-chavez-jr-unanimous-decision-boxing-victory-news",
    "summary": "– Jake Paul is back in the ring after a long absence from the ring, and he's back with a win over Julio Cesar Chavez Jr. in Anaheim, Calif., this week. The social media sensation, who's been battling Chavez Jr. for three years, won a unanimous decision in a 10-round cruiserweight bout at the Honda Center. The judges' scorecards read 99-91, "
  },
  {
    "title": "Jake Paul defeats Chavez Jr by unanimous decision in boxing fight",
    "source": "Al Jazeera English",
    "publishedAt": "2025-06-29T06:15:39Z",
    "url": "https://www.aljazeera.com/sports/2025/6/29/jake-paul-defeats-chavez-jr-by-unanimous-decision-in-boxing-fight",
    "summary": "– Celebrity boxer Jake Paul has defeated former middleweight boxing champion Julio Cesar Chavez Jr by unanimous decision in a cruiserweight fight in California, United States. The 28-year-old YouTube influencer-turned-boxer overcame Chavez Jr with a judges' score of 99-91, 97-93 and 98-92 in the 10-round fight at Honda Center in Anaheim on Saturday night. Chavez Jr, 39"
  },
  {
    "title": "US farmers devastated after record-setting rains leave crops rotting: 'We've got farmers posting some pictures of just whole fields under water'",
    "source": "Yahoo Entertainment",
    "publishedAt": "2025-06-29T11:00:38Z",
    "url": "https://www.yahoo.com/news/us-farmers-devastated-record-setting-110038073.html",
    "summary": "– A record-breaking month of record rainfall hit Alabama in May, causing widespread disruptions, including on farms, where farmers reported discarding gallons of rotting strawberries and delaying planting of fields full of tomatoes, per Yellowhammer News. \"All kind of diseases comes from rain, and too much of it will just cause the plants to wilt and die and cause them to get bacteria and that kind of infection,\" a farmer tells CBS 42"
  },
  {
    "title": "Messi mania turns Miami into America's soccer city - as big decisions loom",
    "source": "BBC News",
    "publishedAt": "2025-06-29T05:16:44Z",
    "url": "https://www.bbc.com/sport/football/articles/ckgj1494g1jo",
    "summary": "MLS star Lionel Messi is in line to become a co-owner of Inter Miami when he retires . Barcelona offered nothing in the way of a contract nor even the slightest clue how they might be able to register him if he did return to Miami . Miami has become America's soccer city since Messi arrived ."
  },
  {
    "title": "I took a $12-an-hour job at Whole Foods after losing my job in higher education. It changed the trajectory of my life.",
    "source": "Business Insider",
    "publishedAt": "2025-06-29T09:05:01Z",
    "url": "https://www.businessinsider.com/took-12-hour-job-whole-foods-after-layoff-higher-ed-2025-6",
    "summary": "– It's not always easy to let go of a job, but it's not always easy to let go of a job. In 2010, I was an academic counselor at a community college in Washington, DC. I had worked in community education as a GED writing teacher, a tech training program manager, and an ESL teacher. The tutoring center had no budget or staff. When my one-year contract ended, it wasn't renewed,"
  },
  {
    "title": "'It's a joke! It's NOT football!' - Maresca fumes after two-hour CWC weather delay",
    "source": "Sky Sports",
    "publishedAt": "2025-06-29T06:35:00Z",
    "url": "https://www.skysports.com/football/news/11095/13389972/chelsea-boss-enzo-maresca-fumes-after-two-hour-club-world-cup-weather-delay-its-a-joke-its-not-football",
    "summary": "– Chelsea's last-16 clash with Benfica took nearly five hours to complete due to a weather delay, the BBC reports. The game, which was suspended for almost two hours due to a thunderstorm in Charlotte, was suspended for almost two hours after the players were taken off the field and fans were told to vacate the seating bowl at the Bank of America Stadium. After extra-time, Chelsea beat Benfica 4-1 after extra-time to reach the quarter-"
  }
]